{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"2ba15736-a1fc-59cc-8db7-0a422972957d","excerpt":"I like Swift . But Xcode’s support of Swift is… lacking (to be polite).  My biggest woe is that code completion up and vanishes in projects. This is especially…","html":"<p><a href=\"http://blog.swilliams.me/words/2014/09/10/thoughts-on-swift/\">I like Swift</a>. But Xcode’s support of Swift is… lacking (to be polite). </p>\n<p>My biggest woe is that code completion up and vanishes in projects. This is especially problematic when dealing with Cocoa libraries because method names tend to be verbose and descriptive. I find myself thinking “I know it’s called <a href=\"https://developer.apple.com/library/ios/DOCUMENTATION/UIKit/Reference/UINavigationController_Class/index.html#//apple_ref/occ/instm/UINavigationController/popToRootViewControllerAnimated:\">popToRoot-something-somthing</a> and was it on UIViewController or the navigationController?“. What would’ve taken two seconds of poking through code-completion to figure that out turned into a solid minute of searching documentation. Multiply this every time you can’t explicitly remember every part of a method call (and spell it correctly) and tasks that normally take an hour are now a significant part of a day. </p>\n<p>The tools that Apple provides are now hindering development. I’m not alone in that sentiment. On Apple’s developer forums (account needed to view) there are a few threads with names like <a href=\"https://devforums.apple.com/message/1067119#1067119\">“Can SourceKit possibly crash more often on a Swift project?”</a> and <a href=\"https://devforums.apple.com/thread/248397?start=0&#x26;tstart=0\">“Xcode 6.1b3 Swift editing is becoming very difficult”</a>. </p>\n<p>One of those threads recommends deleting two folders: <code class=\"language-text\">~/Library/Developer/Xcode/DerivedData</code> and <code class=\"language-text\">~/Library/Caches/com.apple.dt.Xcode</code>. This does the job for me. It happens often enough that I created a hot key for it with <a href=\"http://www.keyboardmaestro.com/main/\">Keyboard Maestro</a>.</p>\n<figure class=\"center\">\n    <img alt=\"Keyboard Maestro Screenshot\" src=\"/images/assets/xcode-swift-maestro.png\">\n    <figcaption>This will yell at you if those folders don't exist, but I can live with that.</figcaption>\n</figure>\n<p>You could do something similar with <a href=\"http://www.alfredapp.com/\">Alfred</a> or any other launcher type of app.</p>\n<p>It’s kind of sad that I have to create this kind of shortcut to maintain my sanity, but I remain hopeful. If Apple is betting big on Swift (and I think they are), then they’ll <em>have</em> to improve the tool support for it.</p>","frontmatter":{"title":"Dealing with Xcode and Swift","date":"October 30, 2014"}}},"pageContext":{"slug":"/dealing-with-xcode-and-swift/","previous":{"fields":{"slug":"/x-wing-nostalgia/"},"frontmatter":{"title":"X-Wing Nostalgia"}},"next":{"fields":{"slug":"/app-number-2-emergency-contacts/"},"frontmatter":{"title":"App #2 - Emergency Contacts"}}}}