{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"7164b96c-7ab0-58a6-b362-49247d44db5c","excerpt":"Let’s talk about trust. Team members who trust each other feel psychologically safe. This means they’ll be emboldened to act as themselves without fear of…","html":"<p>Let’s talk about trust. Team members who trust each other feel psychologically safe. This means they’ll be emboldened to act as themselves without fear of blowback or negative repercussions. They’ll focus on the work in front of them without worrying about their boss or co-workers blasting them for it, even if they make mistakes. The opposite is a detriment - they burn too much time double and triple checking every last bit of communication making sure it falls in line with arbitrary office politics. </p>\n<p>One of the pillars of psychological safety is trust. Trust that happens  between manager and employee, and also trust from team member to team member. That kind of trust takes time to build up, but the good news is that the process can begin at any time.</p>\n<h2>Tell them the things you probably don’t want to</h2>\n<p>I like to tell my teams the things I’m nervous about. At one team meeting, I spoke at length of the actions the company can take to “spy” on employees, such as that their inbox is forwarded to me once they leave the company or that all it takes is a few clicks from the IT department and I could read every single email or slack message that they have sent. Most of the team already knew that in theory, but hearing from me just how <em>simple</em> it is was a bit of an eye opener. I also said how many times I had personally taken those measures (very, very rarely, and only for good reasons). </p>\n<p>It was a bit of an awkward conversation, but it engendered trust between all of us because they knew what kind of power I could wield, even if I rarely used it. It also gave them an understanding of what they’d need to be cautious of if they needed to have a truly <em>private</em> conversation with me or each other. Understanding what kind of privacy you do or do not have is important for trust.</p>\n<h2>Ask if they understand their part in the company’s bottom line</h2>\n<p>It’s good for one to know, whether significant or not, how their work impacts how your company makes money. I like to ask this question in my 1:1s with my direct reports and the answers are occasionally surprising. It might be obvious to you, the manager, how the corporate machine works, but for a worker it may not be.</p>\n<p>Here’s an example: I’ve worked in service organizations for most of my career. At a basic level,  this means you track the hours you work for a client and that time is billed to them. Relatively straightforward, but there are many more details that go in to the equation. What happens if deadlines are missed? What happens if a client is NET 180 (meaning they don’t pay invoices for 180 days - half a year(!))? And, if that’s the case, how does that affect the company’s revenue and reporting, because brother you better believe it does.</p>\n<p>Even if an employee is “just” a tiny cog in a massive machine, it’s beneficial for them to understand how their contribution helps the wheels of the company turn. Knowing that their work is important to someone somewhere allows them to take pride in what they do - their work matters! (If their work doesn’t actually matter… then you should fix that)</p>\n<h2>Be honest when delivering bad news, but not too honest</h2>\n<p>If you’re a manager, you’ll probably know about bad news first. Don’t sugar coat it or try to spin it into a positive if there isn’t a silver lining. “We’re gonna miss our target for the quarter. That ain’t great.” Rather than “Team, I’m very excited about a big opportunity for us to demonstrate our grit and perseverance to our customer base and blah blah blah.” Employees are smart and will sniff out the BS… and when that happens, trust plummets.</p>\n<p>It’s ok to say what you’re feeling, but be careful if things aren’t looking good. “We missed our numbers and it’s sales’s fault and I think we’re screwed” might seem true in the moment but it can become a self-fulfilling prophecy even when that particular situation might have still had hope. If your own personal cynicism and pessimism is leaking out in your communication, you’re not doing your job as a leader. Your duty to your team is to motivate them and to empower them to do good work. Instead, “Look, we missed our target, and that’s not good. I’m nervous and I’m also a little scared because it means things could get worse for us. BUT, there <em>is</em> a way out and here’s what we’re gonna do…” conveys the seriousness of the situation, as well as your own personal feelings, but also presents a path forward so that people don’t just dwell on the crisis.</p>\n<p><em>[Note: if it is catastrophic, <a href=\"https://kotaku.com/telltale-employees-left-stunned-by-company-closure-no-1829272139\">like the whole company is shutting down</a>, treat people like adults and deliver that news promptly so that they don’t have to panic and scramble to find new jobs.]</em></p>\n<p>This list is not exhaustive, but I have found these things to be particularly effective. Trust is built up over time. It takes constant care and attention to grow, must be demonstrated consistently, and can be lost in a heartbeat if you ever stop treating your employees like the fully actualized humans that they are.</p>\n<hr>\n<p><em>Shout out to <a href=\"http://samdavies.me\">Sam Davies</a> for helping edit this.</em></p>","frontmatter":{"title":"Building Trust on Teams","date":"November 01, 2018"}}},"pageContext":{"slug":"/building-trust-on-teams/","previous":{"fields":{"slug":"/im-a-fast-learner/"},"frontmatter":{"title":"I'm a Fast Learner"}},"next":{"fields":{"slug":"/whining-vs-venting/"},"frontmatter":{"title":"Whining vs Venting"}}}}