{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"df7961f4-993d-568b-8f1c-6afc3d22c242","excerpt":"A new Apple device! I’m required to have opinions. Here they are in a contrived fashion! The Good Great UI and aesthetics. It’s faster. Scrubbing through video…","html":"<p>A new Apple device! I’m required to have opinions. Here they are in a contrived fashion!</p>\n<h1>The Good</h1>\n<p>Great UI and aesthetics.</p>\n<p>It’s faster.</p>\n<p>Scrubbing through video is significantly improved. I almost don’t believe how much better it is.</p>\n<p>Siri works as advertised. Accuracy, speed, and results are all great.</p>\n<p>All the potential!</p>\n<h1>The Bad</h1>\n<p>Siri doesn’t index content stored in iTunes libraries on the network. So to get to all the DVDs and Blu-rays I’ve ripped I have to use the same UI as the old Apple TV.<sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup></p>\n<p>Siri doesn’t work with Music. Not for music libraries on the network, iTunes Match, or Apple Music. I really don’t understand this one, I’m hoping it comes soon.</p>\n<p>Only one remote can be paired with it. This makes gaming tricky. Hoping this changes soon too.</p>\n<h1>The Ugly</h1>\n<p>Passwords. This has already been discussed at length everywhere. One thought I had would be that it’d be cool to enter passwords via Siri. Y’know, like that one scene in TNG:</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 75%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/oNrWgjh9tnU\" frameborder=\"0\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p>(A Touch ID powered remote would probably be better)</p>\n<p>App discoverability. It’s really bad, and I don’t know how they’re going to fix it. Top Charts was just added, which is better than nothing, but if someone wants to market their app anywhere online they have no way to provide a link to it! “Go to the app store, search for s-o-m-e-t-h-i…” is all kinds of awful.</p>\n<p>Overall I like it. I have almost no reason to use the Roku now<sup id=\"fnref:2\"><a href=\"#fn:2\" rel=\"footnote\">2</a></sup>.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>I do not have Plex, so I don't know if that circumvents it. If it does, I may grab it asap.</p>\n</li>\n<li class=\"footnote\" id=\"fn:2\">\n  <p>Other than the rare times there's something on Amazon Video that isn't anywhere else.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"The Good, the Bad, and the Ugly with the Apple TV","date":"November 05, 2015"}}},"pageContext":{"slug":"/the-good-the-bad-and-the-ugly-with-the-apple-tv/","previous":{"fields":{"slug":"/finding-the-last-photo-taken/"},"frontmatter":{"title":"Finding the Last Photo Taken"}},"next":{"fields":{"slug":"/private-extensions-in-swift/"},"frontmatter":{"title":"Private Extensions in Swift"}}}}