{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"7169887b-d140-5450-a216-d5c22fbdc644","excerpt":"Microsoft gets a not-entirely-undeserved reputation for being “evil” by the Slashdot crowd. I will admit that I still find some of the decisions they make as a…","html":"<p>Microsoft gets a not-entirely-undeserved reputation for being “evil” by the Slashdot crowd. I will admit that I still find some of the decisions they make as a company are boneheaded, but recently, some of the dealings I’ve had with developers from within the company have been great, and just downright friendly.</p>\n<p>First off is Scott Hanselman. He’s always been very approachable and has replied to my emails and twitterings.</p>\n<p>Specifically though, I’ve been starting work on a project and was at one point 100% sold on using Open Source based platforms to run it on (<a href=\"http://www.lighttpd.net/\">Lighttpd</a>, <a href=\"http://www.pylonshq.com\">Pylons</a>, and <a href=\"http://www.postgresql.com\">Postgresql</a>). Then I discovered Microsoft’s <a href=\"http://www.microsoft.com/BizSpark/\">BizSpark</a> initiative. Briefly, it allows small companies/startups to have <strong>free</strong> access to Microsoft’s server properties, <em>including production licenses</em>. After three years (or generating $1M per year) you are required to pay full price, but by then you should have either failed, or be receiving enough revenue to afford them.</p>\n<p>I <a href=\"http://twitter.com/swilliams/status/1013585609\">tweeted</a> my intrigue of the program, and received a <a href=\"http://twitter.com/anandiyer/status/1014183736\">reply</a> from <a href=\"http://twitter.com/anandiyer\">Anand Iyer</a> encouraging me to contact <a href=\"http://www.haacked.com\">Phil Haack</a> about the ASP.NET MVC framework and a willingness to get me set up with BizSpark, should I go that direction. I do not follow anandiyer on Twitter, and he does not follow me, which means that he was actively searching for people to help through Twitter.</p>\n<p>Next, I contacted Phil through his blog’s contact form (I knew his Microsoft email, but wasn’t sure if it was correct etiquette to email him direct). I had actually had some dealings with him a few years ago, before he was employed by Microsoft, and have been following his blog for quite some time. I used his open source blog platform, SubText, to power this blog for a while and submitted a bug report or two.</p>\n<p>It did take him a few days to get back to me, though it was the Thanksgiving holiday. In fact, he replied on the day after Thanksgiving, I certainly didn’t check my company mail over that break. After that email I decided to jump back into the Microsoft stack. I sent him a thank you email, and didn’t expect a reply (I probably wouldn’t have sent one), but a couple of hours later, I got a nice “Good luck!” email. Totally unnecessary, but still a nice thing to do.</p>\n<p>Lastly, I’ve been watching <a href=\"http://www.asp.net/learn/mvc-videos/#MVCStorefrontStarterKit\">Rob Conery’s video series on ASP.NET MVC</a>, and thoroughly enjoying them. He not only covers MVC, but also Linq To SQL, Test Driven Development, and a couple of nice patterns that go along with it. I had a question about the coding style in one of the videos and sent him an email, this time directly to his MS address. He responded in less than 10 minutes, far quicker than I would have expected, and answered the question I had.</p>\n<p>I don’t post these encounters to suck up or try to defend some of Microsoft’s past practices, but it is completely apparent to me that Microsoft has some good people working there right now. Some critics will never be satisfied, but I really hope that these experiences are indicative of the direction Microsoft is heading. It’s done enough for me that it looks like I will be a customer of their’s for at least the near future.</p>","frontmatter":{"title":"[Surprisingly?] Non Evil Dealings with Microsoft","date":"December 04, 2008"}}},"pageContext":{"slug":"/2008/12/04/surprisingly-non-evil-dealings-with-microsoft/","previous":{"fields":{"slug":"/2008/10/09/a-new-homepage-whoa/"},"frontmatter":{"title":"A New Homepage (whoa)"}},"next":{"fields":{"slug":"/2009/07/02/so-how-close-was-it-anyway/"},"frontmatter":{"title":"So How Close Was it Anyway?"}}}}