{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"d52b1d34-5b47-556d-a6a7-2fa61b4a9c7e","excerpt":"I really enjoy the flavor that sun dried tomatoes and kalamata olives together and wanted to do something crispy with them. The first time I made this, I didn’t…","html":"<p>I really enjoy the flavor that sun dried tomatoes and kalamata olives together and wanted to do something crispy with them. The first time I made this, I didn’t add the feta, or salt the tortillas. It was still pretty good, but the feta sealed the deal.</p>\n<p>I considered using flatbread instead of tortillas, but I think that would be too thick. Some fresh basil might be good as a garnish too, I’ll try that in the future.</p>\n<p>And considering I made this up as I went, the measurings are probably inaccurate, use your own discretion.</p>\n<p>Ingredients, 1 serving:</p>\n<ul>\n<li>2 T Diced Shallots (or onions)  </li>\n<li>1 T Sun Dried Tomatoes, diced  </li>\n<li>1 T Kalamata Olives, diced  </li>\n<li>1 Clove Garlic, diced  </li>\n<li>2 T butter or olive oil  </li>\n<li>2 T Canola Oil  </li>\n<li>2 Tortillas (I prefer the “raw” ones that need to be cooked)  </li>\n<li>1/4 Cup Shrimp, chopped  </li>\n<li>1 T Lemon Juice  </li>\n<li>1 T White Wine  </li>\n<li>2 T Feta cheese  </li>\n<li>Salt for taste</li>\n</ul>\n<p>Put shrimp in glass bowl and add lemon juice and wine.</p>\n<p>Cook up the tortillas (if needed) and set aside.</p>\n<p>Melt butter and saute shallots for several minutes over Medium heat. Add tomatoes and olives and continue to saute. Add some white wine to deglaze pan if needed.</p>\n<p>Add garlic and shrimp. Cook for a couple of minutes until shrimp is done.</p>\n<p>In a clean pan, add canola oil and a small pinch of salt. Turn heat up to medium high. Rub a small amount of salt onto the tortilla. Place one tortilla in pan and add the shrimp/olive/tomato mixture. Add feta cheese and cover with the other tortilla. Brown each side to make it crispy. Remove to plate, and cut into quarters.</p>","frontmatter":{"title":"Recipe: Mediterranean Quesadilla","date":"September 02, 2008"}}},"pageContext":{"slug":"/2008/09/02/recipe-mediterranean-quesadilla/","previous":{"fields":{"slug":"/2008/07/08/languishing/"},"frontmatter":{"title":"Languishing"}},"next":{"fields":{"slug":"/2008/09/08/the-ideal-home-server/index.html/"},"frontmatter":{"title":"The Ideal Home Server"}}}}