{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"80e7587d-6857-5650-9617-7c5254633201","excerpt":"Trust is a recurring theme  in my management style and I try to start building it before I’ve hired people. Trust is formed when one side of a relationship…","html":"<p><a href=\"/words/2018/11/01/building-trust-on-teams/\">Trust is a recurring theme</a> in my management style and I try to start building it before I’ve hired people. Trust is formed when one side of a relationship opens themselves up in a way that makes them a little more vulnerable. Since it is uncommon for the hiring side to initiate this, I’ve tried going against that grain. It’s a fine line to walk. Paint the wrong picture in the name of “transparency” and people will flee. But do take a long look and be honest in the reality of your company and team. Nothing is perfect, but nobody is looking for perfection, so don’t paint it that way. </p>\n<p>For a few years I kept a running document I called “The Good, The Bad, and The Middle” which detailed the great parts of my employer, the not-so-great parts, and the stuff that was a bit of a mix. I didn’t send it out until we were approaching the end of the hiring process and had established a rapport with the candidate. Trust also can’t be developed if you don’t know a few things about each other first.</p>\n<h2>The Good</h2>\n<p>This is easy. What are the best things about the company and my team in particular? Make it more than “the people are great!” The most common question candidates ask is “What’s your favorite part of working here?” And the most common answer, by far, is “oh, it’s the people!” Which is good to say, but you can distinguish yourself and your company by going further than that. This is your opportunity to brag a bit about what kind of culture those “great people” have created and what the candidate will get to do when they’re hired. One line I have is “You have a significant stake in the company’s future and our bottom line. If you do well, we do well. If you stink up the place, we may lose a client (that’s bad).“</p>\n<p>This <em>should</em> be the longest list of the three categories, but don’t BS it to make it longer. This is the flip-side to the make-your-weaknesses-your-strength-sometimes-I-care-TOO-much bit. People will detect it in an instant and then put you in the box with all the other hyperbolic managers that aren’t connected to reality. That box is massive. Avoid it.</p>\n<h2>The Bad</h2>\n<p>This one’s not so easy. As a manager, you know many sore spots, and sharing them with someone brand new can quickly overwhelm. Presumably, you are working to fix them. State that, and how. If you are not, or have certain things de-prioritized, state that too. For example, this was one of my bullets: “Our on-boarding has gotten loads better, but isn’t great yet. You may feel a little confused your first few weeks.” It paints an accurate picture of what they’ll be getting into. Some of these things are universal — who is truly happy with their on-boarding anyway? — and shouldn’t shock anyone.</p>\n<p>This part is also an opportunity to get a candidate to buy in to helping fix the sore spots. “We aren’t great at [thing] yet, and I want to improve it. I will be looking to you to help us figure that out.“ Do note that this needs to be realistic and within the purview of their job. “I need you to fix the institutional sexism in our company” isn’t gonna fly for a senior engineer, but “help us improve how we work with a mix of remote and on-site people” might.</p>\n<h2>The Middle</h2>\n<p>Note: this isn’t The Ugly. The Ugly goes in with The Bad. In my list I wrote about benefits, travel, the office plan, and similar topics. These are things that may be listed in the job description, but could stand to be fleshed out a more. </p>\n<p>Some may have at one time been in the Bad list, but have improved. Maybe not to the point of being on the Good list, but worth moving. For example, we as a company improved our diversity over the course of a year and while it wasn’t what I’d call “awesome”, it had the right trajectory, and I wanted to highlight that. </p>\n<p>Ok, so now you’ve got a mostly complete list. Next step is to tailor it for the candidate and the position. Someone fresh out of college should not receive the same list as a staff engineer. Further, the list should be kept up to date. I like to update it every time I’m going to send it out. It shouldn’t be a novel either. Nobody will read it if it’s too long. My last iteration clocked in at about 900 words — a little less than the size of this post. Lastly, you need to be mindful of any kind of real restrictions that might affect what you can say. Don’t violate SOX or an NDA. </p>\n<p>This sounds like work, and it is, so why put forth the effort? It conveys that you will be level with a candidate and begins a relationship from a position of trust. For me, it worked like gangbusters. Every single person I sent it to, even if they ended up being hired or not, said it increased their likelihood of accepting an offer.</p>\n<p>Establishing trust that early in the game greatly benefited how I recruited people, and opened up a whole swath of discussion points that could be touched on during the hiring process, or in a one-on-one after hiring. It’s the start of the virtuous cycle of trust.</p>","frontmatter":{"title":"My Recruiting “Trick” - The Good, The Bad, and The Middle","date":"December 11, 2018"}}},"pageContext":{"slug":"/my-recruiting-trick-the-good-the-bad-and-the-middle/","previous":{"fields":{"slug":"/what-are-you-struggling-with/"},"frontmatter":{"title":"What Are You Struggling With?"}},"next":null}}