{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"bc92ba01-2111-50e7-a8f2-22e1267a06d5","excerpt":"","html":"<div><div><div><div><div>\n<p><em>This is reprinted here for posterity from the <a href=\"http://dominican2009.com/2009/07/02/so-how-close-was-it-anyway/\">original post</a>.</em></p>\n<p><em>Most people I’ve talked with have seemed interested in hearing about the fateful “flood hike” as we call it. I will try to recount the details here. I think I am remembering things correctly, but if if I miss a detail, please let me know. And for the parents, the purpose of this post isn’t to frighten or incite worry, but to tell the story. –Scott<br></em></p>\n<p>Sunday was bright and sunny, and we had quite a wonderful and eye opening experience at the local church service that morning. After lunch, the skies clouded up, and we had a little rain, which was normal on the trip thus far. We strapped on our hiking gear and waited for the All Clear from the Camp Director, Roy.</p>\n<p>Eventually, Roy gathered us together and gave us a brief overview of the hike. There was a smaller 15 foot waterfall pretty close to camp; about 25 or so minutes away. But, another 40 minutes beyond that one was a spectacular 50 footer that was worth the effort to get to. “Oh and in the event of a flash flood, do not run, get to higher ground,” Roy said, “but I haven’t seen one of those in my 10 years here.”</p>\n<p>With that admonition, we headed out! The hike was spectacular. There was foliage growing all throughout the paths, and at times it felt like it was a dark tropical rainforest, no beams of sunlight penetrated the tree cover. I made the decision to leave my camera in my bag in the interest of getting to our destination quickly. My rationalization was that I could always take shots on the way back out.</p>\n<p>We hiked up a hill and then down the other side of it into the ravine with the river. The path followed the river the rest of the way, and we were in full view of the first waterfall before long. I did manage to pull my camera out and snap some shots of it and the rapids that poured over the surrounding rocks. <a href=\"http://swilliamsphoto.com/dispatch.fcgi/galleries/DR2009/index_12.html\" title=\"View Pictures\" target=\"_blank\">(View First Waterfall Pictures)</a></p>\n<p>A smaller group of about 10 or so people stayed at the first fall, and the rest of us (roughly 20) climbed up the rock and continued onward. The path this time crossed over the river and then back again a few times. Water was usually up to my ankles at these parts, and nipped at my thighs occasionally in the deepest parts.</p>\n<p>Somewhere near the halfway point between the waterfalls, it started raining harder. The skies were more darkened at this point. I took my last pictures here and returned my camera to my backpack, confident that the weather proofing would keep the water out. I did make a joke about it looking like the Smoke Monster from Lost was about to attack.</p>\n<p>At last we arrived at the big waterfall, and Roy was right, it was totally worth the extra hike. Water streamed down from the heavens into a small pool. There were just enough footholds to get about 20 feet up, jump in, and swim out and do it all over again. Had the sun been out, we could have easily spent hours there.</p>\n<p>However, it was already afternoon and the rain wasn’t looking like it was going to stop. We had time for about everyone to do a single rock jump, and that was about it. The current from the falls was also rather strong, and some of the weaker swimmers needed some assistance getting back to shore.</p>\n<p>I was one of the last jumpers, and when I swam back to shore it was decided that we should pack back up and leave. The few people behind me in the jumping line dove in, and swam to the rest of us. The stragglers got their gear on and we started to head back.</p>\n<p>At this point a little geography is required to understand the predicament. The pool with the waterfall was circular and we were at the bottom of it. If your back is towards the fall, then the “path” back will be on your left side. This path involves hopping over rocks and wading through water for about 100 to 200 feet, then crossing to the right side to get to the real dirt path.</p>\n<p>There were two students at the front of the line that were about to wade through some water when everything happened. The waterfall grew huge and unleashed all of the pent up rainwater that had accumulated over the last hour. The waterfall was nothing out of the ordinary, I’d say that it flowed over 10% of the top of the rim normally. All of sudden it jumped to 100%. I do not think I can truly define the sight of the liquid fury that had been loosed. What used to be a pleasant mist from the falls became a sandblaster that pushed the tiny piece of mud into hair, eyes, mouth and skin. You could look at the waterfall for merely an instant before needing to shield your eyes from the sand. Beyond all of this, the noise deafened everything else, it was as if a freight train was passing right by us.</p>\n<p>The water level rose instantly, and rocks that we had jumped across just minutes before were submerged below the roaring water.</p>\n<p>Had we been a minute slower getting out of the pool, people would have died, plain and simple. Additionally, had we been a minute quicker, those in the front who would have been wading through the water would have been carried off by the current. I cannot discount the timing of all this enough. God was watching over us, and we were protected from the storm solely by His hands.</p>\n<p>We started to scamper up the hill that we were still on. I did see some small seeds of panic had begun to manifest, so I tried yelling over the din as calmly as possible, “YOU ARE GOING TO BE OK. GO SLOWLY!” while at the same time, praying for safety in the storm. I alternated between a basic cry for help to God, and reciting what I could remember of Psalm 121.</p>\n<p>At this point, I was at the very back of the line. The person in front me briefly lost his footing, and I bear hugged him up against the wall as we were making our way across. Our best bet for high ground and cover was up a tiny embankment that was covered with bamboo (it looked like bamboo anyway) and plants. In the rush we ended up splitting into two groups; one made of people towards the head of the group, and everyone else. We were still in the same general location, but didn’t have a way to communicate with each other.</p>\n<p>The people in our group made their way up to higher ground and broke off branches to make as much room as they could. Everyone filed up to the spot and bunched together as well as they could. Things were still chaotic, and I and a few others were still only a few feet above what was rushing below us.</p>\n<p>From here, we waited. We were as high as we could climb and couldn’t dare to cross to the other side of the river. Even though the danger of drowning was gone, others were already lined up to take the place. Since the waterfall was still so close to us, it was impossible to dry off. Everyone was wearing swimsuits and basic covering, so if the waters didn’t subside in a certain amount of time, cold would have become an issue. Additionally, this was meant to be a day hike so nobody had a flashlight in the event the sun went down. Ultimately, if this did happen, things would have turned from bad to worse.</p>\n<p>Flash floods happen every year in Arizona, and you always see the helicopter rescues of people dumb enough to try to drive through a flood zone. We talked about helicopters here, but since we were in a canyon it would have likely been infeasible.  For all intents and purposes, we were on our own.</p>\n<p>After 20 minutes, Roy managed to break through the bamboo that separated us from the other group. We confirmed that everyone was indeed safe, which was a relief. He informed us that there was no danger of water rising to our perch because all of the vegetation that surrounded us was indication that flood waters didn’t go that high.</p>\n<p>Again, we waited some more. This was particularly tough on some of the people at the top of our hill. Their perch was small and steep, meaning they couldn’t get a comfortable foothold. People would take turns leaning against the hard rock wall before needing to shift to a new spot.</p>\n<p>Eventually, the sun broke through. Some of the older folks sang a rendition of Good Day Sunshine that lifted the spirits. The rain had stopped, but the waters were still too high and too fast to attempt a return. More waiting was needed.</p>\n<p>We could see that the water was dropping; rocks that had previously been submerged started to show their peaks. After perhaps an hour and a half from our initial frenzy to the high ground, we finally embarked back towards camp.</p>\n<p>The biggest hurdle was immediately beyond our position. While the water had lowered, and the current slowed, certain spots in the river were still treacherous. Fortunately Roy had a rope, and managed to attach it to assist with the worst part. We went one by one across a rock, using the rope for balance. Some of us did slip, but they were able to regain their footing and everyone made it across.  I was one of the slippers, and briefly dipped my backpack completely underwater. I gritted my teeth, but was thankful that I had just fully insured everything in there before the trip.</p>\n<p>With that behind us, it was a simple trip back. The current was still pretty strong, and some of the rattled students needed an extra hand to cross here and there, but the most serious injury was that the water had washed off the bug repellant, creating a buffet for all the mosquitos around the river.</p>\n<p>We made it back to camp. Nobody was hurt beyond scrapes and bruises, nobody suffered from hypothermia, but everyone was covered in mud. A cold shower never felt so good. My shoes had an extra 5 pounds of dirt and gravel in them. By the time we left camp, several days later, they were still not dry. Eventually, my camera dried out and was working for the rest of the trip.</p>\n<p>All in all, it quite the adventure! I truly believe that there is no blame that should be shouldered by anyone. This was a freak occurrence, and now the camp leadership knows the signs to prevent this from happening again. Yes, we should have turned back when it started raining harder, but I can understand the logic and decision behind pressing on. If I had never seen a flash flood in 10+ years in a location, I would have done the same thing. It could have been worse, but God was protecting us out there.</p>\n<blockquote class=\"posterous_medium_quote\">\n<p>I lift up my eyes to the hills. From where does my help come? My help comes from the Lord, who made heaven and earth.</p>\n<p>He will not let your foot be moved; He who keeps you will not slumber. Behold, He who keeps Israel will neither slumber nor sleep.</p>\n<p>The Lord is your keeper; the Lord is your shade on your right hand. The sun shall not strike you by day, nor the moon by night.</p>\n<p>The Lord will keep you from all evil; He will keep your life. The Lord will keep your going out and your coming in from this time forth and forevermore.</p>\n<p>–Psalm 121, ESV</p>\n</blockquote>\n</div></div></div></div></div>","frontmatter":{"title":"So How Close Was it Anyway?","date":"July 02, 2009"}}},"pageContext":{"slug":"/2009/07/02/so-how-close-was-it-anyway/","previous":{"fields":{"slug":"/2008/12/04/surprisingly-non-evil-dealings-with-microsoft/"},"frontmatter":{"title":"[Surprisingly?] Non Evil Dealings with Microsoft"}},"next":{"fields":{"slug":"/2009/08/19/2646590/index.html/"},"frontmatter":{"title":"Untitled"}}}}