{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"68effdde-b185-5186-b2e2-f8fd3dd75cea","excerpt":"I enjoy photography, and I think I’ve been slowly getting better at it.Â However,Â I have felt like I’ve just been a rut for the longest time. I do think that…","html":"<p>I enjoy photography, and I think I’ve been slowly getting better at it.Â However,Â I have felt like I’ve just been a rut for the longest time. I do think that part of it is simply laziness brought on by the fact that I don’t have much motivation to get out of the air conditioning when it’s 110+ outside.</p>\n<p>So, I’m going to try to suck it up and actually go out to some of the “sites” around Phoenix. I’ll probably be doing this on weekends, and if anyone would care to join me, I’d love to have you.</p>\n<p>I’ll be visiting:</p>\n<ul>\n<li>Papago Park, specifically the Hole-in-the-rock. This weekend.</li>\n\t<li>Desert Botanical Gardens. This is mostly because my brother-in-law is getting married here next year and I will be doing the pictures, so I'd like to scout out the area.</li>\n\t<li>The Phoenix Zoo. I was never too fond of zoos when I was a kid, maybe I'll like them more now.</li>\n\t<li>Camelback Mountain.</li>\n\t<li>Pinnacle Peak. I have a friend who goes out rock climbing here from time to time, I'd like to catch some of that in action.</li>\n\t<li>The Superstition Mountains. There are tons of trails all around here, by the time I get around to this, it should be cool enough to get some quality hiking.</li>\n\t<li>Four Peaks.</li>\n\t<li>Downtown Phoenix and the Biltmore area, for architectural stuff.</li>\n</ul>\nAt some point I'd like to take more extended trips up through northern Arizona, and hit various places in the Mogollon Rim, and the various canyons.\n<p>Does anyone else have some good ideas for places that lend themselves well to photography?</p>","frontmatter":{"title":"Forcing Creativity","date":"August 18, 2006"}}},"pageContext":{"slug":"/2006/08/18/forcing-creativity/","previous":{"fields":{"slug":"/2006/08/14/night-factory/"},"frontmatter":{"title":"Night Factory"}},"next":{"fields":{"slug":"/2007/07/20/open-source-and-the-user-experience/"},"frontmatter":{"title":"Open source and the 'user experience'"}}}}