{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"31fcef77-084b-5bc5-af43-3118f786fac7","excerpt":"","html":"<div><div><div><div><div>\n<p>Don't save full paths to resources in your iOS app<sup>1</sup>. \nI'm working on an iPad application, and this just bit me pretty hard.</p>\n<p>Your application lives in a directory kind of like this: <code>/blah/blah/blah/Applications/EE8E3EBF-A7A9-4680-81D0-BB5E7DFE859E/Thing.app/</code> That big old string of capital letters and numbers is a <a href=\"http://en.wikipedia.org/wiki/Guid\">GUID</a>, which means that your app is guarenteed to have its own unique folder in the file system. What I <strong>didn't</strong> know was that this will change every time you update the app. This behavior doesn't happend during development/debugging.</p>\n<p>I was storing the whole path to audio files in a database<sup>2</sup>, so when I released a second beta to my testers, all their clips from the first beta stopped working and caused crashes because the app was looking for files in paths that no longer existed.</p>\n<p>The fix was to only store the filename of the audio because the whole path could just be generated at runtime, and then migrating everyone's data to the new way (which also was bug prone).</p>\n<ol>\n<li>Don't ever accuse me of burying the lede.</li>\n<li>This would've happened if those values were stored in a plist, xml file, or anywhere.</li>\n</ol>\n</div></div></div></div></div>","frontmatter":{"title":"Don't Save Full Paths to Resources in Your iOS app","date":"August 03, 2013"}}},"pageContext":{"slug":"/2013/08/03/dont-save-full-paths-to-resources-in-your-ios-app/index.html/","previous":{"fields":{"slug":"/2013/07/22/two-movies-one-core/index.html/"},"frontmatter":{"title":"Two Movies, One Core"}},"next":{"fields":{"slug":"/2013/08/03/how-i-straight-up-murdered-the-cricket-in-my-bedroom/index.html/"},"frontmatter":{"title":"How I Straight-Up Murdered the Cricket in my Bedroom"}}}}