{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"0da6cdcd-f692-5a5b-a478-5bcdc4197d7a","excerpt":"Developers tend to plow through the path of least resistance. Any amount of friction they encounter tends to be routed over or around. For example, I’ve worked…","html":"<p>Developers tend to plow through the path of least resistance. Any amount of friction they encounter tends to be routed over or around. For example, I’ve worked at a place where Sharepoint was the mandated document storage for the company. The problem is that Sharepoint is awful and unless it was setup by experts, difficult to find what you’re looking for.<sup>1</sup> Since it was so convoluted, developers ignored it.</p>\n<p>This lead to bigger problems. A sort of <a href=\"http://en.wikipedia.org/wiki/Oral_tradition\">oral tradition</a> was inadvertently created and persisted. Since developers were ignoring documentation, requirements were missed and features were implemented incorrectly. Fingers were pointed and words were exchanged.</p>\n<p>Now, imagine for a moment you were the manager in charge of this lot and suddenly found out that your document system was completely ignored by everyone on your team. Bad managers try to correct this with the heavy-handed approach and enforce the IT policy. I’ve seen this happen and it isn’t pretty. It usually results in the <a href=\"http://www.britannica.com/EBchecked/topic/166626/divine-right-of-kings\">Divine Right of Management</a> being invoked, and then rapidly returns to status quo when said manager is not looking.</p>\n<p>What should you do instead? Keeping that convoluted game of telephone doesn’t work, and erects huge barriers for any new person. <a href=\"http://designingsocialinterfaces.com/patterns/Pave_the_Cowpaths\">Paving the cowpaths</a> may not necessarily be the best approach either because it could cement bad practices<sup>2</sup>. Anarchy is not a reliable cowpath.</p>\n<p>Being a good manager is about removing the friction from your team to enable them to do good work. What’s the friction in the above scenario? Dealing with a crummy document management system. How do you remove that? One team I’ve worked with used a Github based workflow for source code and started using the <a href=\"https://help.github.com/articles/about-github-wikis\">wikis</a> on Github. Another place used Trello, which required more management, but it was still easy to look stuff up. Heck, you could even have an expert come over and wrestle Sharepoint into being manageable.</p>\n<p>Like everything else, there isn’t a silver bullet here. In fact, so-called silver bullets tend to create these scenarios (all of the bullet points on the box sure looked good to somebody in a position of authority). A good manager will know their team and understand where these points of friction occur. It might be impossible to smooth them over entirely, but every single bit you can scrape away will only make your team more productive.</p>\n<div class=\"footnotes\">\n<p><small>\n1. This shouldn't be a Sharepoint gripe fest, but here's the process you had to go through to find a document if you didn't have a good bookmark. 1) Go to the home page. 2) Click on the \"IT Projects\" \"portal\". 3) Find the right project in a list on the sidebar. 4) Navigate that project's folder hierarchy. Each project's hierarchy is completely arbitrary and built by its own madman. 5) Find the document eventually. It's a Word doc so, 6) Download the doc. 7) Open it. 8) Edit it. 9) Re-upload it.\n</small></p>\n<p><small>\n2. \"Oh just go talk to Henry, he's the one who knows about the Widget structure.\" \"Actually Janet was the one who integrated the Widgets with the Core System.\" \"Yeah, I think I have an email in here somewhere describing that. I'll get back to you in an hour.\"\n</small></p>\n</div>","frontmatter":{"title":"Friction and Teams","date":"July 07, 2014"}}},"pageContext":{"slug":"/2014/07/07/friction-and-teams/","previous":{"fields":{"slug":"/2014/06/28/fujifilm-x100s/"},"frontmatter":{"title":"Fujifilm X100s"}},"next":{"fields":{"slug":"/2014/07/10/naming-your-stuff/"},"frontmatter":{"title":"Naming Your Stuff"}}}}