{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"e47a2bb4-a3f3-5b4a-884c-0e69f1571668","excerpt":"Swift is a new language developed by Apple. I’ve been using for a few side projects.  On my first glance, I thought Swift would be a great language for…","html":"<figure class=\"center\">\n    <img src=\"/images/assets/swift-logo.png\" alt=\"Swift Logo\" />\n    <figcaption></figcaption>\n</figure>\n<p>Swift is a new language developed by Apple. I’ve been using for a few side projects. </p>\n<p>On my first glance, I thought Swift would be a great language for beginners. I’m not 100% sure if that’s still the case. A beginner language should push you into a positive feedback loop: do something, see it work, do some more, and so on. Swift and Xcode 6 do some of this with aplomb, especially with playgrounds, but I found some features of the language can be frustrating until you have a deeper understanding of what’s going on.</p>\n<p>Optionals are the biggest part of that. They’re kind of crazy at first. Lot’s of ?‘s and !‘s running around. When I was starting with Swift, Xcode would constantly complain that I was missing one. Sometimes it would tell me which one was missing, but sometimes it didn’t. After reading the documentation a little more and thinking about it, things started to click. Handling nil values is important in any language, and handling them poorly can lead to some truly marvelous bugs or security issues. Swift makes you face them much earlier in the process. I think this is a good thing, though it can make for a frustrating start. It’s also made me think if I’m handling nils properly in other languages I use.</p>\n<p>I’m still working on my own personal style, but I think I should be using more computed properties. A rule I’m toying with is to keep on making methods for “verbs” like <code class=\"language-text\">moveFileToThing</code>, but use properties for “nouns” like <code class=\"language-text\">allSampleAssets</code>, even if that property makes several other calls within its implementation. This might require renaming certain methods in order to better comply with that style; if <code class=\"language-text\">allSampleAssets</code> took a <code class=\"language-text\">sort</code> parameter it couldn’t be a property, so I’d rename it to <code class=\"language-text\">queryAllSampleAssets(sort: NSSortDescriptor)</code>.</p>\n<p>Even though it’s a brand new thing, there is still a good amount of Objective C and Cocoa baggage. The standard collections use <code class=\"language-text\">AnyObject</code> where <code class=\"language-text\">id</code> used to be, which means you’ll need to do some explicit casting to the type you need. I found it easier when dealing with an <code class=\"language-text\">NSDictionary</code> or <code class=\"language-text\">NSArray</code> to not try to cram all the casting and then manipulating into a single line of code. </p>\n<p>Enums have reams of power that could be used for evil. I like the way <a href=\"http://nsscreencast.com/episodes/130-swift-json-redux-part-1\">NSScreencasts uses enums with JSON parsing</a>, but it’s hard to comprehend. If you have more of a functional programming background, I suspect this would be easier.</p>\n<p>Swift is going to be huge. I think Apple does have a language on its hands that’ll last for its next 20 years. There are still some rough edges and potential pitfalls, but It has become the language I prefer when creating iOS apps.</p>","frontmatter":{"title":"Thoughts on Swift","date":"September 10, 2014"}}},"pageContext":{"slug":"/2014/09/10/thoughts-on-swift/","previous":{"fields":{"slug":"/2014/09/07/a-trip-to-joshua-tree-and-back/"},"frontmatter":{"title":"A Trip to Joshua Tree and Back"}},"next":{"fields":{"slug":"/2014/10/15/the-best-customer-service/"},"frontmatter":{"title":"The Best Customer Service"}}}}