{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"75363d8e-4ae5-55c1-89a3-59fa14f5ea9d","excerpt":"In  Part 1  I talked about my first few computers. They were an important part of my childhood, and shaped the person I would become and the career I chose…","html":"<p>In <a href=\"/words/2014/01/09/my-computers-through-the-ages\">Part 1</a> I talked about my first few computers. They were an important part of my childhood, and shaped the person I would become and the career I chose. When I went to college I started to build and upgrade my own PCs. Things went well enough at first, but then got a little out of hand.</p>\n<h3>Dark Ages</h3>\n<p><strong>Custom PC #1</strong> (2000) Since I was still in college, I didn’t have very much money and bought some dirt cheap parts from websites that may have been run by questionable companies. These parts were leftover from <a href=\"http://en.wikipedia.org/wiki/Oem\">OEMs</a> and didn’t have real retail boxes. Some would just show up with a minimal layer of bubble wrap around the bare hardware. I had bought a <a href=\"http://en.wikipedia.org/wiki/Pentium_iii\">Pentium III CPU</a>, but screwed up putting the heatsink on it. It was too unstable to run at its advertised speed, so I had to <em>underclock</em> it or it’d just lock up the whole system within minutes. It could run <a href=\"http://en.wikipedia.org/wiki/Quake_III_Arena\">Quake 3</a> well enough though at that speed.</p>\n<p><strong>Custom PC #2</strong> (2001) If at first you don’t succeed right? This was the only time I strayed away from the Intel and bought an <a href=\"http://en.wikipedia.org/wiki/Amd_athlon\">AMD Athlon processor</a>. I had learned from my mistake and assembled it correctly, but it also had problems and would lock up at odd times. I remember trying to show my parents just what a computer could do by playing an assortment of Led Zeppelin mp3s, and halfway through Stairway it froze and needed to be restarted. I was either not a very good PC builder or kept buying crummy parts. Probably a little from column A and a little from column B.</p>\n<p>I hit the nadir of my computer history while putting this computer together. During the assembly I saw that there were some weird red splotches on the inside of the case but couldn’t figure out what they were. More started to appear and then I realized that I had cut my hand on a sharp hunk of metal from the bargain basement case and I was bleeding all over it.</p>\n<h3>Working Stiff</h3>\n<p><strong>Custom PC #3</strong> (2004) I had a real jobby-job and was earning more than the $Nothing I was in college, so I was finally able to afford computer parts that came in actual boxes, and wouldn’t require keeping a roll of bandages nearby. I went back to Intel and got a <a href=\"http://en.wikipedia.org/wiki/Pentium_IV\">Pentium 4</a> to run <a href=\"http://en.wikipedia.org/wiki/Windows_xp\">Windows XP</a>. This was my first DIY computer that actually ran ok. It was also the first time I used an LCD monitor. The <a href=\"http://reviews.cnet.com/lcd-monitors/dell-ultrasharp-1905fp/4505-3174_7-31232074.html\">19” Dell Ultrasharp</a> was a big upgrade to the cumbersome CRTs I had been using.</p>\n<p><strong>Custom PC #4</strong> (2007) My last Windows PC, and also the best. My brother-in-law worked at Intel and as “payment” for taking some pictures at his wedding gave me a nice <a href=\"http://en.wikipedia.org/wiki/Core_2_duo#Core_2_Duo\">Core 2 Duo</a> CPU. The prior one worked well enough, but was very loud. Pentium 4’s were known to run hot, and my case required a number of fans to keep mine from melting through to the Earth’s core. The Core 2 Duo was much quieter. </p>\n<p>Honestly, there wasn’t anything very memorable about this one. It was a Camry — reliable, but otherwise unremarkable. </p>\n<p>Things were starting to change for me. I had been a software developer working in the <a href=\"https://msdn.microsoft.com/\">Microsoft stack</a> for a long time and felt a seven year itch to move on to different things.</p>\n<h3>Fruit</h3>\n<p>I never liked Apple computers. When I was growing up in the early-mid 90s, it was the “dark” times for Apple, when they kept releasing unremarkable computers with ancient notions of software. Even when Steve Jobs returned,  I thought of them as too expensive and fluffed up with a bunch of annoying marketing. I especially despised the original iMac<sup>1</sup> with the <a href=\"http://www.youtube.com/watch?v=83nS4EGKU04\">goofy colors</a>, <a href=\"http://en.wikipedia.org/wiki/Apple_USB_Mouse\">awful mouse</a>, and thought that it was dead in the water because it lacked a floppy drive. This wouldn’t be the first time a technical prediction of mine was hilariously off base.</p>\n<p>As time went on I did start to like the industrial design of a few models. The original <a href=\"http://en.wikipedia.org/wiki/PowerBook_G4#Titanium_PowerBook_G4\">Titanium Powerbooks</a> (so thin!), and the <a href=\"http://en.wikipedia.org/wiki/G4_cube\">G4 Cube</a> looked especially nice to my eyes, but they were still way too expensive for my budget.</p>\n<p>Around the time they switched over to Intel processors I started to reconsider my position. I liked that they were <a href=\"https://developer.apple.com/library/mac/documentation/MacOSX/Conceptual/OSX_Technology_Overview/SystemTechnology/SystemTechnology.html\">Unixy</a>, making certain kinds of web development easier. Eventually, some of the more garish designs of OS X were <a href=\"http://arstechnica.com/apple/2007/10/mac-os-x-10-5/3/\">stripped back</a>, and I decided to make the leap.</p>\n<figure>\n    <img alt=\"30 Years of the Mac\" src=\"images/assets/30years.png\" />\n    <figcaption>30 Years of the Mac</figcaption>\n</figure>\n<p>Apple recently celebrated the <a href=\"http://www.apple.com/30-years/\">30th anniversary of the original Macintosh</a>. I joined the Mac train in 2009, and have [mostly] liked it ever since. Next time I’ll go into the specifics of the Macs that I’ve owned, and why I recommend them.</p>\n<div class=\"footnotes\">\n1. It looked like a suppository, ok?\n</div>","frontmatter":{"title":"My Computers Through the Ages Part II","date":"January 25, 2014"}}},"pageContext":{"slug":"/2014/01/25/my-computers-through-the-ages-part-ii/","previous":{"fields":{"slug":"/2014/01/20/keep-your-developer-saw-sharp/"},"frontmatter":{"title":"Keep Your Developer Saw Sharp"}},"next":{"fields":{"slug":"/2014/01/26/demystifying-ruby-dsls/"},"frontmatter":{"title":"Demystifying Ruby DSLs"}}}}