{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"47087574-4073-5ea4-9449-fde2b6ec17b1","excerpt":"We just published episode 2 of  the podcast . I’m still very new at this, but I’ve already learned more than I anticipated. Most of these are forehead slappers…","html":"<p>We just published episode 2 of <a href=\"https://scott-williams-bc50.squarespace.com/podcast/2014/12/3/2-the-proliferation-of-duplo\">the podcast</a>. I’m still very new at this, but I’ve already learned more than I anticipated. Most of these are forehead slappers that now you can avoid when you make your podcast.</p>\n<p>If you want to do a <a href=\"http://thepodcastersstudio.com/tps-ep-47-recording-a-double-ender-podcast/\">double-ender</a>, don’t use Quicktime’s built-in audio recording - it smushes all the audio into a single track. <a href=\"http://www.ecamm.com/mac/callrecorder/\">Ecamm Call Recorder</a> or <a href=\"https://rogueamoeba.com/piezo/\">Piezo</a> will keep them separate.</p>\n<p>Have each person say something like “Recording” when they start recording their end of the call. This makes it orders of magnitude easier to line up the separate audio tracks during post production. <sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup></p>\n<p>Plug your headphones directly into your microphone. Doing something else will likely lead to some nasty <a href=\"http://blog.swilliams.me/words/2014/12/02/how-to-add-a-noise-gate-in-garageband-10/\">headphone bleed</a>.</p>\n<p>If you’re using a <a href=\"http://www.amazon.com/Blue-Microphones-Yeti-USB-Microphone/dp/B002VA464S/ref=sr_1_1?sr=8-1&#x26;ie=UTF8&#x26;keywords=blue%2Byeti&#x26;tag=thepetzoo-20&#x26;qid=1417634348\">Blue Yeti</a>, switch to Cardioid mode. It’s the “heart” or “pacman” symbol. Turn the gain down on it too.</p>\n<p>You need to <a href=\"https://www.apple.com/itunes/podcasts/specs.html\">submit your podcast feed to Apple</a> if you want your podcast to be in iTunes (and you really want that). According to their <a href=\"https://www.apple.com/itunes/podcasts/creatorfaq.html\">FAQ</a> it can take 24 hours for that feed to be approved. But if you submit your feed on a common US holiday week, like say the Monday before Thanksgiving, it might take significantly longer.</p>\n<p>If you have something pre-made you want to say on air, write it down first because your brain will simply refuse to cooperate if you try to just remember it.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>Got this via <a href=\"http://www.theincomparable.com/theincomparable/\">The Incomparable</a>, one of my absolute favorites.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"Things I Learned When Making a Podcast","date":"December 03, 2014"}}},"pageContext":{"slug":"/things-i-learned-when-making-a-podcast/","previous":{"fields":{"slug":"/lets-talk-photo-licensing/"},"frontmatter":{"title":"Let's Talk Photo Licensing"}},"next":{"fields":{"slug":"/the-ios-development-year/"},"frontmatter":{"title":"The iOS Development Calendarw"}}}}