{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"864d32e6-cea1-5dcf-9c99-1d8b1ea33bd1","excerpt":"Most people who have even heard of it would say that it’s a Twitter clone, created out of  frustrations over the direction it was heading . Currently, the  home…","html":"<p>Most people who have even heard of it would say that it’s a Twitter clone, created out of <a href=\"http://daltoncaldwell.com/what-twitter-could-have-been\">frustrations over the direction it was heading</a>. Currently, the <a href=\"http://app.net\">home page</a> makes it look like an identity and/or messaging service. Over the last couple years, it’s bounced around and offered different services. According to the founders, the <a href=\"http://daltoncaldwell.com/an-audacious-proposal\">genesis</a> of it was to create a backend-as-a-service to enable developers to make the next generation of online applications.</p>\n<p>The problem was that I don’t think App.net ever moved beyond the shadow of “It’s a Twitter clone.” App.net’s API does offer the capabilities to make some really <a href=\"http://riposteapp.net/\">slick</a> <a href=\"http://favd.net/\">apps</a>, but there hasn’t been any one thing that captured everyone’s attention to make them say “Wow!” There is the <a href=\"https://alpha.app.net/\">microblogging service</a>, the <a href=\"https://omega.app.net/\">messaging service</a>, the <a href=\"https://broadcast.app.net\">broadcast service</a>, the <a href=\"https://backer.app.net/\">crowdfunding service</a> and <a href=\"http://blog.app.net/2013/01/28/announcing-the-app-net-file-api/\">the cloud storage service</a>. If you’re being unkind, you could call them the Twitter clone, the iMessage clone, the Push Notification clone, the Kickstarter clone, and the Dropbox clone. Each of those services are good, but none of them have differentiated themselves from their biggest competitors. If all of those went dark tomorrow, everybody would be able to move back to what they were using before without too much trouble. </p>\n<p>There was a great initial fervor when App.net launched. Some big names supported it both vocally and financially. Unfortunately, their engagement petered out over time. The most damning evidence of this? Out of all the people on <a href=\"https://web.archive.org/web/20120801133202/https://join.app.net/\">this page</a> the only person who still interacts on App.net regularly is <a href=\"https://alpha.app.net/garrytan\">Garry Tan</a><sup>1</sup>. </p>\n<p>I was very bullish on App.net, which makes the <a href=\"http://blog.app.net/2014/05/06/app-net-state-of-the-union/\">latest news</a> saddening. It isn’t the end yet, but when you have literally no employees working on a service and suspend the biggest <a href=\"http://blog.app.net/2012/09/27/announcing-the-app-net-developer-incentive-program/\">incentive to develop on your platform</a>, it isn’t too far away. Right now the best case I see for App.net is\nthat it continues along as is, but with little to no growth. I did renew my paid account this year, but I don’t know if the service will be around for another renewal next time.</p>\n<p>I don’t like armchair quarterbacking. Saying what <a href=\"http://www.theonion.com/articles/woman-a-leading-authority-on-what-shouldnt-be-in-p,35922/\">should have been done</a> is too easy and requires no effort on my part. I do think that a lesson to take away from this is that identity is important and needs to be clear to customers.</p>\n<div class=\"footnotes\">\n1. It looks like <a href=\"https://alpha.app.net/peterrojas\">Peter Rojas</a> and <a href=\"https://alpha.app.net/andrewchen\">Andrew Chen</a> have feeds that syndicate to App.net. Nobody else on that list had any kind of post within the last month.\n<p>And as pointed out by <a href=\"https://alpha.app.net/chriskrycho/post/29913830\">Chris Krycho</a>, it looks like Garry's posts are just cross-posted from Twitter using <a href=\"https://zapier.com/\">Zapier</a>.</p>\n</div>","frontmatter":{"title":"What is App.net?","date":"May 06, 2014"}}},"pageContext":{"slug":"/2014/05/06/what-is-app-dot-net/","previous":{"fields":{"slug":"/2014/05/06/oh-cool-you-want-to-be-a-web-developer/"},"frontmatter":{"title":"Oh Cool You Want to be a Web Developer?"}},"next":{"fields":{"slug":"/2014/05/12/how-i-started-to-understand-model-binding-magic-in-ember/"},"frontmatter":{"title":"How I Started to Understand Model Binding Magic in Ember"}}}}