{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"575f2903-83b3-5981-9b79-3959c99385e5","excerpt":"When you’re a solo developer, you can use Git in nearly any darn way you choose. No branching? Ok. Branch on everything? Sure. Want all your commit messages to…","html":"<p>When you’re a solo developer, you can use Git in nearly any darn way you choose. No branching? Ok. Branch on everything? Sure. Want all your commit messages to consist of “stuff”? Knock yourself out. You might regret some of that in the long run, but it’s not hassling anyone else. But, as soon as you add another person into the mix, things will have to change.</p>\n<p>One gigantic benefit from collaboration is having a second set of eyes look at your code. GitHub makes this easy if you follow a few steps.</p>\n<p><em>[ed: This might be old hat for some of you, but I don’t know if I’ve ever read an entire guide for this, so I’m writing it all down. Please send me <a href=\"https://twitter.com/swilliams\">feedback</a>, nicely, if there’s a problem.]</em></p>\n<h2>Create an Organization</h2>\n<p>This one is optional, but does help in a few ways. The Organization becomes the face of any projects underneath it. It also makes a few things a little easier with regard to deployments, issue tracking, and documentation.</p>\n<h2>Everyone Forks from the Organization</h2>\n<p>If the repository is called <code class=\"language-text\">some-org/project-x</code>, then each developer forks that to create <code class=\"language-text\">swilliams/project-x</code>, <code class=\"language-text\">sally-developer/project-x</code>, and so on. If a repository is private on the Organization, your forks will be private too, and won’t count against your own private project count.</p>\n<h2>Clone Your Fork</h2>\n<p>Now get your local copy.</p>\n<p><code class=\"language-text\">git clone https://github.com/swilliams/project-x.git</code></p>\n<h2>Set up Remotes</h2>\n<p>Your fork on GitHub will automatically be your <code class=\"language-text\">origin</code> remote. Add a remote for the Organizations repository. By convention this is typically called <code class=\"language-text\">upstream</code>.</p>\n<p><code class=\"language-text\">git remote add upstream https://github.com/some-org/project-x.git</code></p>\n<h2>Work in Branches</h2>\n<p>Working on a feature? Create a branch <code class=\"language-text\">feature-abc</code>. Fixing a bug? Create a branch <code class=\"language-text\">issue-254-login-done-broke</code>. Keep <code class=\"language-text\">master</code> clean.</p>\n<p><code class=\"language-text\">git checkout -b feature-abc</code></p>\n<h2>Push Branches to Origin</h2>\n<p>Done with a feature or an issue? Push it back up to <code class=\"language-text\">origin</code> (your fork).</p>\n<p><code class=\"language-text\">git push origin feature-abc</code> (you can add a <code class=\"language-text\">-u</code> flag too to track the remote branch too)</p>\n<h2>Create a Pull Request</h2>\n<p>Why do we go to the hassle of creating all those branches? Because with branches, you can create multiple outstanding Pull Requests at once. If you did all your development in <code class=\"language-text\">master</code>, any additional commits you push up will be added to an open Pull Request, which can cause issues.</p>\n<p>Multiple small Pull Requests are much easier to review. Would you rather review 3 files over 5 commits or 50 files and 75 commits?</p>\n<h2>Someone Else Reviews the Pull Request</h2>\n<p>Perhaps my favorite piece of functionality in GitHub is the Pull Request review process. Use it to annotate code and discuss. Merge it in if everything is good.</p>\n<h2>Rules for the Road</h2>\n<ol>\n<li>Keep the master branch clean. That should be ready to go live if necessary. This means tests should be passing, everything compiles, nothing important should be broken, etc.</li>\n<li>Never commit directly to <code class=\"language-text\">upstream</code>. Upstream should only be updated through Pull Requests. Exception: pushing tags. </li>\n<li>Pull from <code class=\"language-text\">upstream</code> regularly. The more codebases diverge, the more likely a nasty merge problem will occur.</li>\n<li>Keep branches small. Just reiterating it again.</li>\n<li>There are exceptions to every rule. Use them intelligently.</li>\n</ol>","frontmatter":{"title":"Basic GitHub Workflow For Collaboration","date":"June 30, 2015"}}},"pageContext":{"slug":"/basic-github-workflow-for-collaboration/","previous":{"fields":{"slug":"/sharing-your-screen-with-a-client/"},"frontmatter":{"title":"Showing Your Screen to a Client"}},"next":{"fields":{"slug":"/watchkit-connectivity-and-file-transfers/"},"frontmatter":{"title":"WatchKit Connectivity and File Transfers"}}}}