{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"75532d22-31f9-5236-aab4-a4d14b375839","excerpt":"","html":"<div><div><div><div><div>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">Music management has been one of those things that I suspected would be one of the bigger hurdles<sup style=\"\"><span>1</span></sup> to move into The Cloud. The storage and bandwidth requirements seemed too high to easily conquer.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">But, we’re very close right now.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">I recently discovered <a href=\"http://www.lala.com\">LaLa</a>, an online music store, similar to iTunes, but with the potential for much more. For 10 cents, you can purchase a “web song” that allows you to play that song as many times as you want through the browser interface. You can purchase a downloadable mp3 for a little more, but that isn’t the important part.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">Right now, I can listen to these songs at work or at home, where I spend 90% of my time. The other 10% is in the car and when I exercise. The solution to this? An iPhone app. With quick enough 3G speeds, I could stream whatever song I could want, anywhere I could get a quality signal. As speeds eventually increase, it would only get better.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">Apparently, <a href=\"http://www.techcrunch.com/2009/03/28/an-exclusive-first-look-at-lalas-iphone-app/\">LaLa has been working on an iPhone app</a> for some time, but it has never been released. I highly suspect Apple rejected it on the basis that it competes with the iTunes store.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">On one hand, that sucks tremendously, but on the other, I can’t really blame them. If you could get music with the same quality and access as the iTunes store for about 1/10 of the price, why would you ever buy from Apple? The pessimist in me is that Apple is working on their own version and will release it with iTunes 9, and crush Lala.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\">I remain optimistic though, Apple has been under a lot of scrutiny over certain App Store decisions, and hopefully they will be persuaded to play nice and let LaLa push their app through. I converted my music listening to 100% digital a while ago; I look forward to not having to figure out how to store it at all.</p>\n<p style=\"margin-top: 10px; margin-bottom: 10px; margin-right: 0px; margin-left: 0px;\"><em style=\"\"><span>1. Real Photo/Video/Audio editing being the other ones. And I don’t mean making rectangles with Picnik, I mean creating complex layer masks on 200+ MB images.</span></em></p>\n<p> </p>\n</div></div></div></div></div>","frontmatter":{"title":"Music in the Cloud?","date":"August 25, 2009"}}},"pageContext":{"slug":"/2009/08/25/music-in-the-cloud/index.html/","previous":{"fields":{"slug":"/2009/08/24/a-little-thing-i-like-about-os-x/index.html/"},"frontmatter":{"title":"A Little Thing I Like About OS X"}},"next":{"fields":{"slug":"/2009/08/26/refreshing-21/index.html/"},"frontmatter":{"title":"Refreshing"}}}}