{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"8bd824bb-ee43-507d-a676-053c0a570385","excerpt":"","html":"<div><div><div><div><div>\n<p>It's been a whirlwind last 48 hours, and I now finally have a few minutes. My mind is still spinning. </p>\n<p></p>\n<div>My Saturday, Sunday, (and part of Monday) was spent at the <a href=\"http://zackarias.com/workshop/\">OneLight Workshop</a> that <a href=\"http://zackarias.com\">Zack Arias</a> puts on. I've been following his blog for some time and as soon as I saw that he was coming to Phoenix, I jumped at the chance.</div>\n<p></p>\n<div>Saturday night was just a mixer to get to know Zack and the other photographers. It was at <a href=\"http://gangplankhq.com/\">Gangplank's workspace</a>, and if you haven't been there before, do make the trip. They have a great vibe and community at the place. If I lived just a little bit closer, I'd frequent the place much more often.</div>\n<p></p>\n<div>If you've ever read Zack's blog, or heard him in an interview, he is the exact same dude in person. Which I love.  When Erica and I walked into the mixer he put out his hand and said \"Hi, I'm Zack\". I, and everyone else there knew who he was (his name was in the freaking title of the workshop), but he still introduced himself like salf-of-the-earth kind of guy that he is.</div>\n<p></p>\n<div>All of the morning and part of the afternoon was a lecture on lighting. I wasn't sure what to expect out of this. When I hear \"5 hour lecture\" I look for my pillow, or start dinking around on <a href=\"http://twitter.com/swilliams\">Twitter</a>. However, the first time I checked my phone, it was already 1pm. He had managed to talk so effectively that my stomach didn't even harass me at its normal time. This is no small feat. </div>\n<p></p>\n<div>I had precisely two huge light-bulb moments during the lecture too. The first was regarding dialing in the best exposure, and the second was me finally really grasping how to use the <a href=\"http://en.wikipedia.org/wiki/Inverse-square_law\">inverse-square law</a>. These alone were worth the price of admission.</div>\n<p></p>\n<div>Everything else went swimmingly. The models were incredibly gracious and patient in putting up with 10 relative newbies. I've included my favorites from our time with them. Just in case I didn't have enough reasons to love the guy, I stuck around for a little while longer and Zack gave me some input on <a href=\"http://shootsy.com\">Shootsy</a>. We ended at around 2am on Monday. And yes, I had to go to work about 6 hours after that.</div>\n<p></p>\n<div>All in all, I would <strong>highly</strong> recommend this to anyone looking to get better at flash based lighting.</div>\n<p></p>\n</div></div></div></div></div>","frontmatter":{"title":"Trip Report: OneLight Workshop","date":"April 18, 2011"}}},"pageContext":{"slug":"/2011/04/18/trip-report-onelight-workshop/index.html/","previous":{"fields":{"slug":"/2010/12/07/rails-3-routing-gotcha/index.html/"},"frontmatter":{"title":"Rails 3 Routing Gotcha"}},"next":{"fields":{"slug":"/2011/05/19/i-got-your-airprint-right-here/index.html/"},"frontmatter":{"title":"I Got Your AirPrint Right Here"}}}}