{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"69a864f8-2a5d-5a78-ad65-5f48a09e6a76","excerpt":"I think I have something to write about semi-regularly here. One of the major tasks for my job will be to streamline the build process for a couple of…","html":"<p>I think I have something to write about semi-regularly here. One of the major tasks for my job will be to streamline the build process for a couple of applications that are starting to wrap up their development. I have some experience using open source technology like <a href=\"http://nant.sourceforge.net/\">NAnt</a> and <a href=\"http://confluence.public.thoughtworks.org/display/CCNET/Welcome+to+CruiseControl.NET\">CruiseControl.net</a>, however this project uses Microsoft’s <a href=\"http://msdn2.microsoft.com/en-us/teamsystem/aa718934.aspx\">Team Foundation Server</a> - which I have not used before.</p>\n<p>So, as I bring myself up to speed here, I figured I’d blog about it.</p>\n<p>First I’ll need to install the whole mess. My current MSDN Subscription does not have the full versions of TFS and the client tools, so I’ll be using the 180 day trial version (available for <a href=\"http://www.microsoft.com/downloads/details.aspx?familyid=D5C12289-F4E4-49A9-9235-AB2F6D4CA097&amp;displaylang=en\">free here</a> if you feel like playing along at home). From what I gathered, installation is rather involved, so I expect this process to take most of the night. As for the client end, I’ll start with the plain old <a href=\"http://blogs.vertigosoftware.com/teamsystem/archive/2006/05/22/2778.aspx\">Team Explorer</a> plugin, and will probably upgrade to <a href=\"http://msdn2.microsoft.com/en-us/teamsystem/aa718822.aspx\">Team Suite</a>’s trial as needed.</p>","frontmatter":{"title":"A topic","date":"August 28, 2007"}}},"pageContext":{"slug":"/2007/08/28/a-topic/","previous":{"fields":{"slug":"/2007/08/20/wikipedia-nonsense/"},"frontmatter":{"title":"Wikipedia Nonsense"}},"next":{"fields":{"slug":"/2007/08/29/tfs-installation/"},"frontmatter":{"title":"TFS - Installation"}}}}