{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"601bbf76-9ece-5c56-8007-bb33fafb2d98","excerpt":"","html":"<div><div><div><div><div>Or, the waiting is the hardest part...<p></p>\n<div>Flying anywhere requires quite a bit of sitting around and waiting. This is why I am not the most pleasant person on travel days. Here's how I get to Dallas:</div> <div>\n<ul>\n<li>Leave the house at about 4pm to get to the airport early enough.</li>\n<li>Park in the garage, walk to bus stop.</li>\n<li>\n<b>Wait</b> for the shuttle to the terminal.</li>\n<li>Get on bus, ride to terminal.</li>\n<li> <b>Wait</b> in line at security.</li>\n<li>Talk to the nice TSA screener. Show ID and boarding pass. Go to the metal detectors.</li>\n<li>\n<b>Wait </b>for the person in front of me who has obviously never been on a plane before. Yes, she did just send their water bottle and laptop through the scanner still in her bag. I wonder if she's still wearing her shoes too? Bingo.</li> <li>Go through security, find terminal, sit and <b>wait<i> </i><span>for boarding.</span></b>\n</li>\n<li><b><span>Boarding zone is called, walk towards plane.</span></b></li> <li>\n<b>Wait</b> to get in seat because some knucklehead is taking 5 minutes to stuff his oversized carry-on in the bin, then takes off his jacket and tries to stuff it up there too.</li>\n<li>Get in seat. <b>Wait</b> for rest of plane to board. Knucklehead's family is apparently flying with him too and holds up the line even more.</li> <li>Plane boarded, and doors close, <b>wait</b> for plane to pull away from terminal and go to runway.</li>\n<li>Finally up in the air. Watch movies on iPod. This is sort of like waiting, but in an uncomfortable seat with little to no legroom. So it's totally different!</li> <li>Land in Dallas. <b>Wait</b> for plane to taxi to terminal, which is apparently a mile away.</li>\n<li>Seriously, are we circling the airport on the ground? I can walk faster than this.</li>\n<li>Reach gate. Doors open. <b>Wait </b>for people to get their stuff down from the bins. Again, this seems to be a very involved process for some. I tend to be the kind of person who reaches up to the handle, pulls it down and walks out. But that's just me.</li> <li>Walk to rental car shuttle pickup. <b>Wait</b> for shuttle. I've exhausted my <a href=\"http://twitter.com/swilliams\">twitter</a> and facebook info on my <a href=\"swilliams\">phone</a> by now and am getting antsy.</li> <li>Get on shuttle, drive to rental car center.</li>\n<li>Get rental car, drive to hotel.</li>\n<li>\n<b>Wait</b> for night management to open the front door since they lock it at 11pm. </li>\n<li>It is now about midnight and I'm finally in my room.</li> </ul>\n<div>That's a lot of waiting. After about the 7th or 8th \"wait\" up there I'm about ready to snap and start choking people. The most annoying issue I have with this is that there just isn't that much I can do to make things run any smoother. I <i>could </i>get to the airport a little later, but then I run the risk of missing my flight altogether if something goes wrong, or the TSA line is abnormally long.</div> <p></p>\n<div>I've since started traveling 100% carry-on bags, since waiting to check luggage, and then waiting for it to be regurgitated by the airline, is just more time to be frustrated. Fortunately, my company has switched to using Avis for rental cars, so I can just walk by their desk, see my name and car on a big board, and head straight to it with the keys waiting for me.</div> <p></p>\n<div>I will be glad when this stint ends in a few weeks, if only because my brain will appreciate not having to actively fight a complete shutdown due to all the waiting.</div>\n</div>\n</div></div></div></div></div>","frontmatter":{"title":"Apologies to Tom Petty","date":"April 05, 2010"}}},"pageContext":{"slug":"/2010/04/05/apologies-to-tom-petty/","previous":{"fields":{"slug":"/2010/03/30/rental-car-of-the-week/"},"frontmatter":{"title":"Rental Car of the Week"}},"next":{"fields":{"slug":"/2010/04/12/commentary-on-the-new-iphone-terms/index.html/"},"frontmatter":{"title":"Commentary on the New iPhone Terms"}}}}