{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"4f7f206e-9534-50b2-aedc-54d5780d056b","excerpt":"Recently,  Glenn Greenwald ,  Laura Poitras , and  Edward Snowden  took part in an  ‘IAMA’   converstation on Reddit . It’s a long one, and somewhere down the…","html":"<p>Recently, <a href=\"https://firstlook.org/theintercept/greenwald/\">Glenn Greenwald</a>, <a href=\"http://en.wikipedia.org/wiki/Laura_Poitras\">Laura Poitras</a>, and <a href=\"http://en.wikipedia.org/wiki/Edward_Snowden\">Edward Snowden</a> took part in an <a href=\"http://www.reddit.com/r/iama\">‘IAMA’</a> <a href=\"http://www.reddit.com/r/IAmA/comments/2wwdep/we_are_edward_snowden_laura_poitras_and_glenn\">converstation on Reddit</a>. It’s a long one, and somewhere down the page, <a href=\"http://www.reddit.com/r/IAmA/comments/2wwdep/we_are_edward_snowden_laura_poitras_and_glenn/coup7ld\">this question was asked</a>:</p>\n<blockquote>\n<p>What’s the best way to make NSA spying an issue in the 2016 Presidential Election? It seems like while it was a big deal in 2013, ISIS and other events have put it on the back burner for now in the media and general public. What are your ideas for how to bring it back to the forefront?</p>\n</blockquote>\n<p>Funny how this seems to happen. Snowden gave a tremendous answer. There’s too many great quotes to pull from his response, so I’ll just copy/paste the <a href=\"http://www.reddit.com/r/IAmA/comments/2wwdep/we_are_edward_snowden_laura_poitras_and_glenn/courx1i\">whole thing</a>.</p>\n<blockquote>\n<p>This is a good question, and there are some good traditional answers here. Organizing is important. Activism is important.</p>\n</blockquote>\n<blockquote>\n<p>At the same time, we should remember that governments don’t often reform themselves. One of the arguments in a book I read recently (Bruce Schneier, “Data and Goliath”), is that perfect enforcement of the law sounds like a good thing, but that may not always be the case. The end of crime sounds pretty compelling, right, so how can that be?</p>\n</blockquote>\n<blockquote>\n<p>Well, when we look back on history, the progress of Western civilization and human rights is actually founded on the violation of law. America was of course born out of a violent revolution that was an outrageous treason against the crown and established order of the day. History shows that the righting of historical wrongs is often born from acts of unrepentant criminality. Slavery. The protection of persecuted Jews.</p>\n</blockquote>\n<blockquote>\n<p>But even on less extremist topics, we can find similar examples. How about the prohibition of alcohol? Gay marriage? Marijuana?</p>\n</blockquote>\n<blockquote>\n<p>Where would we be today if the government, enjoying powers of perfect surveillance and enforcement, had — entirely within the law — rounded up, imprisoned, and shamed all of these lawbreakers?</p>\n</blockquote>\n<blockquote>\n<p>Ultimately, if people lose their willingness to recognize that there are times in our history when legality becomes distinct from morality, we aren’t just ceding control of our rights to government, but our agency in determing thour futures.</p>\n</blockquote>\n<blockquote>\n<p>How does this relate to politics? Well, I suspect that governments today are more concerned with the loss of their ability to control and regulate the behavior of their citizens than they are with their citizens’ discontent.</p>\n</blockquote>\n<blockquote>\n<p>How do we make that work for us? We can devise means, through the application and sophistication of science, to remind governments that if they will not be responsible stewards of our rights, we the people will implement systems that provide for a means of not just enforcing our rights, but removing from governments the ability to interfere with those rights.</p>\n</blockquote>\n<blockquote>\n<p>You can see the beginnings of this dynamic today in the statements of government officials complaining about the adoption of encryption by major technology providers. The idea here isn’t to fling ourselves into anarchy and do away with government, but to remind the government that there must always be a balance of power between the governing and the governed, and that as the progress of science increasingly empowers communities and individuals, there will be more and more areas of our lives where — if government insists on behaving poorly and with a callous disregard for the citizen — we can find ways to reduce or remove their powers on a new — and permanent — basis.</p>\n</blockquote>\n<blockquote>\n<p>Our rights are not granted by governments. They are inherent to our nature. But it’s entirely the opposite for governments: their privileges are precisely equal to only those which we suffer them to enjoy.</p>\n</blockquote>\n<blockquote>\n<p>We haven’t had to think about that much in the last few decades because quality of life has been increasing across almost all measures in a significant way, and that has led to a comfortable complacency. But here and there throughout history, we’ll occasionally come across these periods where governments think more about what they “can” do rather than what they “should” do, and what is lawful will become increasingly distinct from what is moral.</p>\n</blockquote>\n<blockquote>\n<p>In such times, we’d do well to remember that at the end of the day, the law doesn’t defend us; we defend the law. And when it becomes contrary to our morals, we have both the right and the responsibility to rebalance it toward just ends.</p>\n</blockquote>","frontmatter":{"title":"The Law Doesn't Defend Us; We Defend the Law","date":"February 24, 2015"}}},"pageContext":{"slug":"/2015/02/24/the-law-doesnt-defend-us-we-defend-the-law/","previous":{"fields":{"slug":"/2015/02/18/podcast-technology/"},"frontmatter":{"title":"Podcast Technology"}},"next":{"fields":{"slug":"/2015/02/25/front-to-back-number-8-my-first-diablo/"},"frontmatter":{"title":"Front to Back #8 — My First Diablo"}}}}