{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"d4533b48-2c3b-5e35-a4f2-709af864ec32","excerpt":"","html":"<div><div><div><div><div>About a month ago I picked up the basic 13\" MacBook Pro. My primary intent was that I needed a non-Windows portable for rails development<span>1</span>. Overall, I really like it, and these are just my thoughts about it. First the bad things:<p></p>\n<div><b>Bad</b></div>\n<div>\n<ul>\n<li>The Resolution. The iPhone 4's resolution is more than half of the laptop's 1280x800 pixels. Apple has always had crappy resolutions on their notebooks (unless you're shelling out more than $2k).</li> <li>The keyboard is weird. No right-control, no forward delete, no page-up, page-down, home, or end. There are workarounds, but I miss those guys. This is also keeping me from getting the bluetooth keyboard; same layout.</li> <li>Slooooow hard drive. On the 13\" it was either a 5400rpm one or an expensive solid state. And the store didn't have and SSD ones on hand.</li>\n</ul>\n<div><b>Good</b></div>\n<div>\n<ul>\n<li>The trackpad. I've never been a huge fan of trackpads, but I'm really digging this one. I don't know if it's because this trackpad is huge, or the multi-touch capabilities (or both), but I only miss a mouse when needing finer cursor management.</li> <li>The battery. It lasts between 6-8 hours, easy. How do you not like that? Some people whine about the lack of an interchangable battery, but I don't care about that.</li>\n<li>Construction. I think the quality of the build is just ridiculous. The iMac is good, but this feels better. I get a feeling that Apple cares a little more about their line of notebooks than their desktops. It's also pretty light, to the point that I wonder if the MacBook Air would be worth it.</li> </ul>\n<p></p>\n</div>\n<p></p>\n<div><ol>\n<li><span>One thing I've noticed is that running Lightroom and Photoshop is just ridiculously slow on both this and my iMac, but programming is pleasurable. Isn't that backwards? Macs are for creative fluff and PCs are for coding...</span></li> </ol></div>\n</div>\n</div></div></div></div></div>","frontmatter":{"title":"MacBook Pro Likes & Dislikes","date":"August 27, 2010"}}},"pageContext":{"slug":"/2010/08/27/macbook-pro-likes-dislikes/index.html/","previous":{"fields":{"slug":"/2010/08/23/nice-idea-via-neven-mrgan/index.html/"},"frontmatter":{"title":"Nice Idea via Neven Mrgan"}},"next":{"fields":{"slug":"/2010/09/03/yeah-this-is-what-i-wanted-to-see-at-espncom/index.html/"},"frontmatter":{"title":"Yeah this is what I wanted to see at espn.com"}}}}