{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"bb3c5f5e-4d74-5324-b7cb-deb6166be00c","excerpt":"The  Surface  was never the barnburner that Microsoft hoped it would be. People have been  predicting   its demise  for the  last year . It’s suffered from…","html":"<p>The <a href=\"http://www.microsoft.com/surface/en-us\">Surface</a> was never the barnburner that Microsoft hoped it would be. People have been <a href=\"http://www.deccanchronicle.com/140629/technology-mobiles-and-tabs/article/microsoft-discontinue-surface-tablet\">predicting</a> <a href=\"http://arstechnica.com/gadgets/2014/08/surface-2-prices-slashed-hinting-at-discontinuation-or-replacement/\">its demise</a> for the <a href=\"http://bgr.com/2014/10/09/microsoft-surface-pro-3/\">last year</a>. It’s suffered from <a href=\"https://www.youtube.com/watch?v=iqyTxiTKxgI\">goofy advertising</a> and lately seems to be begging the masses to please think of it instead of an iPad, <a href=\"https://www.youtube.com/watch?v=1jP4O7rEHQ8\">anything but an iPad, oh please</a>! <sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup></p>\n<p>I’m certainly no Don Draper, but that’s not gonna prevent my <del>ego</del> imagination to think of how I’d do it instead. The idea is that the Surface apparently has a nice stylus/pen that can be used by artists. Penny Arcarde’s <a href=\"http://www.penny-arcade.com/news/post/2013/10/28/surface-pro-2\">Mike Krahulik has been a fan</a> and used them to draw their popular web comic. That’s your angle right there. Now, not many people are artists that would benefit from a refined drawing interface, but plenty of people <em>fancy</em> themselves as such. Nike convinced you that sneakers with compressed air in them would make you Michael Jordan, why isn’t Microsoft showing you that Surface would make you <a href=\"http://en.wikipedia.org/wiki/Jim_Lee\">Jim Lee</a>?</p>\n<p>Here’s your commercial: Camera fades in to reveal someone intently working on a Surface. They’re sitting in a comfy chair, or on a couch, or some kind of hipster furniture. We don’t see what’s on the screen yet but we can see them concentrating and cranking away at <em>something</em> with the pen. Cut to the over-the-shoulder shot. We now see a painting/sketch/comic coming to life. </p>\n<p>Cut to closeups of the pen drawing right on the glass. There’s no lag. The pen is able to draw with a fine point. There’s obvious pressure sensitivity. (Things you pretty much can’t do on an iPad, but without calling it by name.) They put the pen down and “smudge” things with their finger.</p>\n<p>Finally the art is done. The artist switches to their website and immediately publishes the work.</p>\n<p>Cut to a desk with the notorious Surface keyboard and a wireless mouse right next to it. The Surface clicks in to the keyboard, sits up on the kickstand and a modern 3D PC game (say, Far Cry 4) starts up (oh yeah, it’s got an i5 and a GPU). Display the tagline: “Make. Publish. Play.”</p>\n<p>Wouldn’t that be more interesting than breakdancing? Wouldn’t that get you pumped up just a little bit? These days I’m a Microsoft cynic, and that would at least get me to raise an eyebrow and <em>wish</em> my iPad could do something like that.</p>\n<p>If Apple is in fact <a href=\"http://9to5mac.com/2015/01/18/kgi-apple-likely-to-sell-stylus-accessory-alongside-12-inch-ipad-pro/\">working on a stylus</a> that avenue will probably close.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>The funny thing is that out of all Apple's products, the iPad is the one that has plateaued the most. Why are you aiming at that one?</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"Surface Marketing","date":"January 28, 2015"}}},"pageContext":{"slug":"/2015/01/27/surface-marketing/","previous":{"fields":{"slug":"/2015/01/21/the-madness-of-errors-in-swift/"},"frontmatter":{"title":"The Madness of Errors in Swift"}},"next":{"fields":{"slug":"/2015/01/28/podcast-appearances/"},"frontmatter":{"title":"Podcast Appearances"}}}}