{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"7232ca9a-4706-54a6-ad11-762839b1407c","excerpt":"We’ve been through the  pre-history , and then the  awkward years . Now we come at last to the present. From here on out, it’s  Apple  all the way down, so if…","html":"<p>We’ve been through the <a href=\"/2014/01/09/my-computers-through-the-ages\">pre-history</a>, and then the <a href=\"/2014/01/25/my-computers-through-the-ages-part-ii\">awkward years</a>. Now we come at last to the present. From here on out, it’s <a href=\"http://apple.com\">Apple</a> all the way down, so if that ruins your day, please feel free to stop reading and go outside to contemplate your existance.</p>\n<p>Why did I switch? Most of it came down to what I use a computer for. I’m a software developer by trade. The first part of my career was mostly in the Microsoft stack, but by the late 2000’s I got the itch to move on to <a href=\"/2013/12/02/the-frustrations-of-the-journeyman/\">something else</a>. Every kind of development platform that I’m interested in runs better on a Unix-like system. Apple doesn’t make me happy 100% of the time, but I don’t think I’ll be leaving their ecosystem for a while.</p>\n<p><strong>24” iMac</strong> <a href=\"http://support.apple.com/kb/sp507\">(2009)</a> I’m not sure what I was expecting when I made the switch, but I wasn’t terribly fond of this one. The hardware was great; a beautiful display, pretty fast processor, and a spacious hard drive. I loved that I didn’t have a beige butt-ugly tower on my desk anymore. My frustrations were entirely with OS X.  It came with <a href=\"http://www.apple.com/support/leopard/\">10.5 Leopard</a>, with <a href=\"http://www.apple.com/support/snowleopard/\">10.6 Snow Leopard</a> released shortly after the computer showed up on my porch. After upgrading, it had a myriad of reliability problems. What made me grind my teeth were the <a href=\"http://en.wikipedia.org/wiki/Kernel_panic\">kernel panics</a>. A kernel panic is an error in the Operating System that it cannot recover from, stopping everything and requiring a restart. You might be familiar with its colloquial name on Windows: the <a href=\"http://en.wikipedia.org/wiki/File:Windows_XP_BSOD.png\">Blue Screen of Death</a>. I would average one of those every month on my iMac, which is astronomically high for an OS marketed with <a href=\"http://a3.img.mobypicture.com/570253fecab177d9605be5d157c59e18_view.jpg\">“it just works”</a> as its slogan.</p>\n<p>It frustrated me enough that I considered going back to Windows. What held me back was that I had started getting more and more into <a href=\"http://rubyonrails.org/\">Rails</a> development, which (still) doesn’t run very well on Windows<sup>1</sup>. I had started to work on a <a href=\"/2013/12/26/whither-shootsy-or-how-i-tried-and-failed-a-startup\">Rails based project</a> that would have benefited from having a laptop in order to work outside the house. Despite my initial reservations for OS X, I doubled down.</p>\n<p><strong>13” MacBook Pro</strong> <a href=\"http://support.apple.com/kb/sp583\">(2010)</a> This was the cheapest Mac laptop at the time. With impeccable timing, I bought this right before Apple released the new <a href=\"http://www.apple.com/macbook-air/\">MacBook Airs</a>. This wasn’t a particularly fast computer, but it showed me how well OS X could work when it doesn’t constantly blow up. I don’t know if my iMac was a bit of a lemon, or if OS X just works better on laptops, but it was noticeable.</p>\n<p>It also made me realize that I could get by with just a laptop. Syncing data between two computers is a bit of a pain, even with things like Dropbox and source control management. On more than one occasion I had to call my wife and walk her through performing an <a href=\"http://hgbook.red-bean.com/read/a-tour-of-mercurial-the-basics.html#x_68\"><code class=\"language-text\">hg push</code></a> in order to send me the latest bits of a project. I held on to this computer for a little while and then sold it to put together enough scratch for the next one.</p>\n<p><strong>15” MacBook Pro</strong> <a href=\"http://support.apple.com/kb/sp620\">(2011)</a> I went laptop only for the first time with this computer. It was my workhorse for almost 3 years. On it, I created Rails apps, iOS apps, and even managed to use it with my day job in .NET-land (through VMWare). It was reliable as a rock even with me mucking around inside it to upgrade the memory and hard drive. Even though I had this computer longer than most others, there’s not a whole lot to say about it, which is a good thing.</p>\n<p><strong>13” MacBook Pro w/Retina</strong> <a href=\"http://support.apple.com/kb/SP691\">(2014)</a> Here we are (finally) in the present. I didn’t think the retina screen would be that much of a deal breaker, but I’d rather sell my left foot than give it up now. I can leave my power cord at home and fit in an entire work day on the battery. Oh yeah, it’s also crazy fast despite only having a dual-core CPU (my last one was a quad). All of that comes in a package just under 3.5 pounds. I’ve only had this computer for a couple of months, but it’s already the best one I’ve ever owned.</p>\n<p>I don’t know what the future will bring. I like the new <a href=\"http://www.apple.com/mac-pro/\">Mac Pro</a>, but not enough to spring for its $3000+ price tag. And I don’t know if I’d go back to a desktop again. I’d like to hold onto this laptop for as long as I can. </p>\n<div class=\"footnotes\">\n1. Rails by itself runs fine on Windows. It's when you start adding gems into the mix that things start going hinky. And then there's the whole cygwin thing. Ugh.\n</div>","frontmatter":{"title":"My Computers Through the Ages Part III","date":"March 06, 2014"}}},"pageContext":{"slug":"/2014/03/06/my-computers-through-the-ages-part-iii/","previous":{"fields":{"slug":"/2014/03/05/migrating-from-squarespace/"},"frontmatter":{"title":"Migrating from Squarespace"}},"next":{"fields":{"slug":"/2014/04/11/changing-your-password/"},"frontmatter":{"title":"Changing Your Password"}}}}