{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"60c2b4e4-3b8f-580f-8278-28c8d6101133","excerpt":"","html":"<div><div><div><div><div>\n<p>Since I have been working in Dallas for the last few months, I have been eating at quite a few restaurants. Thus, I have become very familiar with the after-meal mint. Not all mints are created equal; there are some that are simply better than others. As a service to you, I have ranked them in ascending order:</p>\n<div>\n<ul>\n<li>First, there are the hard-peppermint-candy-cane mints. These are the most common, and while they are a little better than having your breath smell like chimichangas, they aren't memorable. Some places have the ones that are green and brown, which provide a slightly better experience, but still aren't worth writing home about.</li>\n<li>Slightly better than those guys are the fruity cylindrical mints (for lack of a better name). I will usually grab a couple of these and mix flavors. My favorites are blue and red, though I usually tire of sucking on them after a little while.</li>\n<li>Next, are what I believe are called \"pillow\" mints, because they look like pillows. In my experience, I have found these most often at Chick-fil-a's. They are tasty, and remind me a little like chewable Tylenols from when I was kid<sup>1</sup>. The only downside is that after eating them, they turn into a sticky paste that binds to my teeth for the next ten minutes.</li>\n<li>Finally, we come to the king. Andes mints. If a server brings a few of these guys to the table along with the check, he automatically qualifies for a nice tip. \"I'm sorry that the waiter spilled the clam chowder all over your dress, honey, but he brought Andes mints; that's gotta be at least 15%.\" One time I was leaving a place and passed the server station. There was an open and unguarded box of Andes mints sitting right there. Let's just say I had to spend a little extra time in the gym the following day and leave it at that.</li>\n</ul>\n<div>These are the things that I feel I should share about my travels.</div>\n<div><span>1. I may or may not have faked headaches when I was a kid to eat more chewable Tylenols. I liked the flavor. I have no regrets.</span></div>\n</div>\n</div></div></div></div></div>","frontmatter":{"title":"Minty Fresh","date":"March 18, 2010"}}},"pageContext":{"slug":"/2010/03/18/minty-fresh/index.html/","previous":{"fields":{"slug":"/2010/02/11/snoooow/index.html/"},"frontmatter":{"title":"Snoooow"}},"next":{"fields":{"slug":"/2010/03/22/the-long-path-to-a-new-phone/index.html/"},"frontmatter":{"title":"The Long Path to a New Phone"}}}}