{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"5199ac92-0994-56dd-8dec-6eba064f5418","excerpt":"At some point in your career in technology, you’re going to have to make some kind of presentation. This could be connecting your laptop to a projector, sharing…","html":"<p>At some point in your career in technology, you’re going to have to make some kind of presentation. This could be connecting your laptop to a projector, sharing your screen over some video conference, or just have people huddled around your desk. Since I care about you, I’m gonna share some advice about avoiding common pitfalls that might occur.</p>\n<p><strong>Turn off notifications.</strong> Say you’re right in the middle of explaining how beautifully designed your database is to an important client, and one of your friends sends you an email.</p>\n<figure class=\"center\">\n    <img alt=\"oh dear\" src=\"/images/assets/vomit.png\" />\n    <figcaption>Oh dear.</figcaption>\n</figure>\n<p>Your only options are to make an awkward joke, or ignore it completely. Hopefully Jane doesn’t send any follow-ups.</p>\n<p>On OS X you can turn off notifications by clicking the button in the top right of the menu bar, scrolling down, and then turning “Do not disturb” on.</p>\n<figure class=\"center\">\n    <img alt=\"do not disturb\" src=\"/images/assets/donotdisturb.png\">\n</figure>\n<p><strong>Hide everything you aren’t showing.</strong> Again, say you’re presenting something amazing to the top brass at Giant Health Conglomerate Inc. You need to switch from Keynote to a spreadsheet. You minimize Keynote and your Inbox is now in full view. What if there are some strategy emails from your CEO sitting in front of everyone? What if Jane from above has graphically described other things found in her vomit?</p>\n<p>On OS X I like to move my presentation and ancillary windows to a <a href=\"https://support.apple.com/kb/PH18757?locale=en_US\">separate space</a>. One with a very plain wallpaper.</p>\n<p><strong>Use Chrome? Double check the default sites when you open a new tab.</strong> Nothing instills confidence with a prospective client when you open a new tab and the top 8 sites you visit are right there in the open for everyone to see. “Oh, I guess you <em>really</em> like Harry Potter/Star Trek slash fiction?”</p>\n<p>An Incognito window is a quick way to hide all that.</p>\n<p><strong>Similarly, consider clearing your browser history.</strong> Maybe you need to open up a webpage you weren’t anticipating. Maybe you’re checking the <a href=\"http://redis.io/documentation\">redis documentation</a>, but when you type <code class=\"language-text\">red</code> into the address bar, all the subreddits you’ve ever visited are immediately available. Maybe you just browse <a href=\"http://www.reddit.com/r/aww\">/r/aww</a> and everyone is happy, or maybe you visit more… <em>unconventional</em>… ones.</p>\n<p>Ultimately it’s up to you how many awkward situations you want to have with your co-workers and/or clients. Try to just think about what would happen if your mother/rabbi/priest/psychologist were watching.</p>","frontmatter":{"title":"Showing Your Screen to a Client","date":"June 19, 2015"}}},"pageContext":{"slug":"/2015/06/18/sharing-your-screen-with-a-client/","previous":{"fields":{"slug":"/2015/05/17/archiving-old-github-repositories/"},"frontmatter":{"title":"Archiving Old GitHub Repositories"}},"next":{"fields":{"slug":"/2015/06/30/basic-github-workflow-for-collaboration/"},"frontmatter":{"title":"Basic GitHub Workflow For Collaboration"}}}}