{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"19e7d5b6-e826-5875-9ec4-231599b0c5b9","excerpt":"","html":"<div><div><div><div><div>I've been <a href=\"http://www.paulgraham.com/organic.html\">reading about startups</a> and micro isv's for a while now, and have lately been more and more intrigued with writing my <i>own</i> application and selling it. I've had some ideas in the past, and have even started to act on them, but ended up getting sucked into other things and have my grand ideas fizzle back into the aether.<p></p>\n<div>One thing I have been realizing lately though is that the older I get, the less patience I have for dealing with bureaucratic policies and processes that handcuff creativity. If I have passion about something, I will get sucked in and spend every free minute thinking about or working on that one thing. And frankly, that just isn't going to happen when I'm stuck in a gray cube farm working on some line of business application with requirements that change weekly. In fact just the opposite; I procrastinate, surf the Internet, and generally just <a href=\"http://www.imdb.com/title/tt0151804/\">zone out</a>.</div> <p></p>\n<div>So what was I to do? Suicide was out, there might not be pizza in heaven, after all. Instead, a few weeks ago I decided to take a plunge and start the journey of making an application. </div>\n<p></p> <div>I don't want to go into the specifics of it just yet; I'm obviously still in the EARLY phase of everything and may very well change purpose and scope. I will say that it does include my favorite hobby, <a href=\"http://swilliamsphoto.com\">photography</a>, though.</div> <p></p>\n<div>I also don't think this is something that will turn me into a millionaire. I would love, love, <b>love </b>it if this could end up providing enough financially to support my family and me, but that will likely be a ways off. </div> <p></p>\n<div>What concerns me most right now though is the fact that I am single founder, which tends to not yield the best results. I've already seen some of the shortcomings of this approach, I've been second guessing myself quite a bit on certain things. So, if you want to know more, or perhaps even work on this with me, then by all means, shoot me an <a href=\"mailto:scott@krazyyak.com\">email</a> or give me a call. I'll be posting more about the journey and process here as I walk this path.</div> <p></p>\n<div>I'm not one to really make a five year plan, but I do have one goal: I turn 30 in October, so let's see if I can push out a semi-public beta in that time.</div>\n</div></div></div></div></div>","frontmatter":{"title":"A Start","date":"June 29, 2010"}}},"pageContext":{"slug":"/2010/06/29/a-start/index.html/","previous":{"fields":{"slug":"/2010/06/28/quick-tech-tip-rails-and-amazon-ecs-and-missi/index.html/"},"frontmatter":{"title":"Quick Tech Tip - Rails and Amazon ECS and 'missing' Gems"}},"next":{"fields":{"slug":"/2010/06/30/good-copy-woots-acquisition-post/index.html/"},"frontmatter":{"title":"Good Copy - Woot's Acquisition Post"}}}}