{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"f531750e-bed2-5d57-8e3e-aab2b08f9bba","excerpt":"JavaScript has been getting a lot of press lately. You can write  servers  with it, talk to  databases , and of course, it’s the most  common language  in the…","html":"<p>JavaScript has been getting a lot of press lately. You can write <a href=\"http://nodejs.org/\">servers</a> with it, talk to <a href=\"http://www.couchbase.com/\">databases</a>, and of course, it’s the most <a href=\"http://javascript.crockford.com/popular.html\">common language</a> in the world. Yet, in its most popular form, client-side scripting on the Internet, it’s just a giant mess.</p>\n<p>You know what I’m talking about, that mass of thousands of lines of code that does something-but-oh-God-I-hope-it-doesn’t-break. I’ve written that kind of JavaScript. You have too. It’s a big problem that needs to be addressed.</p>\n<h2 id=\"why\"><a href=\"#why\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Why?</h2>\n<p>First, let’s identify the problems. Here’s a function that I just made up, but it’s not too far from the truth.</p>\n<p>Fig 1 - A Common Site</p>\n<p>How many differentthings are going on here? I can see four right off the bat. <em>Individually,</em> each is not a Bad Thing, but when they’re all within the same function, it’s a problem.</p>\n<p>Fig 2 - Event Binding. We’re looking for something in the DOM, and then attaching an event handler to it.</p>\n<p>Fig 3 - AJAX. Specifically, communication with our persistance layer.</p>\n<p>Fig 4 - Business Logic. This a simplification, but we’re analyzing the data and making a logical decision based on it.</p>\n<p>Fig 5 - DOM/UI Manipulation. We’re not just reading the DOM here, but changing it.</p>\n<p>And this little ditty is only 11 lines long. This is the equivalent of inlining your security checks right next to SQL statements, all within a UI template. God help you if you want to actually uncovered a bug in this rat nest down the road.</p>\n<p>And let’s not even get into testing. How would you even start writing a unit test for this function? (Hint: it sucks)</p>\n<h2 id=\"enter-mvc\"><a href=\"#enter-mvc\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Enter MVC</h2>\n<p>Fortunately, messy code is not a new problem. There is an embarrassment of riches out there to help you get your crap together.</p>\n<p>The MVC pattern has been around since the neolithic era of programming. Rails, Django, ASP.NET MVC, CakePHP, etc. have been making developers’ lives much easier on the server side for years. And now, some of that has trickled down to JavaScript.</p>\n<p>A common reaction.</p>\n<p>What makes MVC so popular amongst developers is that it forces you to break your code down into manageable chunks. Mixing AJAX calls and DOM Manipulation in the same functions just doesn’t fly there.</p>\n<p>And, you have a bunch to choose from. In future posts, I’ll be giving a brief description of some of the popular ones. Spoiler: I myself have been using <a href=\"http://documentcloud.github.com/backbone/#\">Backbone</a> and will be going into deeper detail on that one.</p>","frontmatter":{"title":"Your JavaScript Sucks","date":"December 17, 2011"}}},"pageContext":{"slug":"/2011/12/17/your-javascript-sucks/","previous":{"fields":{"slug":"/2011/10/28/my-reaction-to-the-rumor-that-nikon-is-lookin/"},"frontmatter":{"title":"My Reaction to the Rumor that Nikon is Looking to Buy WebOS"}},"next":{"fields":{"slug":"/2011/12/30/your-javascript-sucks-rudiments/"},"frontmatter":{"title":"Your JavaScript Sucks - Rudiments"}}}}