{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"a0029fc6-af83-5b78-aec6-d6cf501592d8","excerpt":"Family is cool and all, but really, the reason we have holidays in AMERICA is to eat too much. Here’s how they rank. This is not opinion, it is fact. Once again…","html":"<p>Family is cool and all, but really, the reason we have holidays in AMERICA is to eat too much. Here’s how they rank. This is not opinion, it is fact.</p>\n<ol>\n<li><strong>Thanksgiving</strong>. Turkey. We do it two ways, the traditional bake, and also a smoked one. Dressing/Stuffing. Potatoes. Pies (never have just one). Everything else. Part of the romanticism for Thanksgiving is also everything that goes with it: family (I happen to like mine), friends, football, cool weather, cooking, showing my kids how to cook. Leftovers are critical: More turkey, turkey soup, turkey sandwiches, more potatoes and stuffing. Here's how much we love Thanksgiving in the Williams house: we make a second Thanksgiving meal before Christmas. Speaking of:</li>\n</ol>\n<ol start=\"2\">\n<li><strong>Christmas</strong>. Roast beef (garlic + rosemary). More potatoes. More Pie. Pudding.</li>\n</ol>\n<ol start=\"3\">\n<li><strong>Memorial Day/Independence Day/Labor Day</strong>. From a meal perspective, these are pretty much the same. Grill and/or barbecue. Beer. Diversity amongst the meat is good.</li>\n</ol>\n<ol start=\"6\">\n<li><strong>Octoberfest</strong>. Bratwurst on crusty rolls with sauerkraut and super grainy mustard. Beer. No it's not a \"real\" holiday, congratulations on pointing that one out. You're a regular Columbo, you are.</li>\n</ol>\n<ol start=\"50\">\n<li><strong>Easter</strong>. Ham. I like various pig derived food products, but baked ham just isn't as good. Eggs are fine and I eat them all the time, but it's hard to make them extra \"special\". How often do you cook a turkey for 8 hours during the year? Compare that to eggs.</li>\n</ol>\n<p>Once again, the logic here is flawless. No conjecture. For realsies.</p>","frontmatter":{"title":"Holiday Meals Ranked in Order of Meal Glory","date":"November 17, 2014"}}},"pageContext":{"slug":"/holiday-meals-ranked-in-order-of-meal-glory/","previous":{"fields":{"slug":"/i-once-caught-a-comet-that-was-this-big/"},"frontmatter":{"title":"I Once Caught a Comet that was THIS Big"}},"next":{"fields":{"slug":"/copying-the-current-page-from-safari/"},"frontmatter":{"title":"Copying the Current Page From Safari"}}}}