{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"ad06bf69-0a01-5ff6-8913-7fa61019a575","excerpt":"My kids and I like to play with Nerf guns. My younger daughter in particular likes to sneak up behind people and shoot them in the back.  She’s devious like…","html":"<p>My kids and I like to play with Nerf guns. My younger daughter in particular likes to sneak up behind people and shoot them in the back. <a href=\"https://youtu.be/3ebPsZl4k5k?t=13s\">She’s devious like that</a>. While running around and shooting each other can be fun, it does start to get a little boring after a while. </p>\n<p>So, we started to implement rules and make more of a contest out of it. We started with a little capture-the-flag, but that was still a little dicey, certain members of the family would either really want a particular stuffed animal to be the flag, while others definitely didn’t want that one to be the flag ever ever ever ever. </p>\n<p>I was familiar with a simple game mechanic of capture points. Each team flips over a card-type thing to their color and they get points for that. The more capture points the better — it keeps everyone moving. If you get shot, you have to go back to your re-spawn point and start over. The catch was that keeping score was too tricky without some kind of impartial observer.</p>\n<p>Being the coder that I am I whipped up something quickly for iOS and called it Red/Blue, for the two teams it had. It’s a basic premise:</p>\n<ul>\n<li>When the app launches, choose how many minutes to play and tap Start.</li>\n<li>The game starts and displays a split screen with two different colors.</li>\n<li>When someone taps a color, ex. Red, a clock associated with Red starts to increment.</li>\n<li>When Blue is tapped, Red is paused, and Blue increments. I added some sound effects to denote when this happens. (it’s just my voice saying “Red” and “Blue”. My kids think this is hilarious.)</li>\n<li>When the main clock counts down to 0, the game is over and whichever color got incremented the most wins.</li>\n</ul>\n<h3>Screenshots</h3>\n<figure class=\"center\">\n    <img alt=\"Start Screen\" class=\"halfsize border\" src=\"https://github.com/swilliams/redblue/blob/master/readme-assets/redblue1.PNG?raw=true\">\n    <figcaption>Start Screen</figcaption>\n</figure>\n<figure class=\"center\">\n    <img alt=\"Game Screen\" class=\"halfsize border\" src=\"https://github.com/swilliams/redblue/blob/master/readme-assets/redblue2.PNG?raw=true\">\n    <figcaption>Game Screen</figcaption>\n</figure>\n<figure class=\"center\">\n    <img alt=\"End Screen\" class=\"halfsize border\" src=\"https://github.com/swilliams/redblue/blob/master/readme-assets/redblue3.PNG?raw=true\">\n    <figcaption>End Screen</figcaption>\n</figure>\n<p>This worked pretty well. We ended up pulling out old iPhones and iPads and laying them on flat surfaces and threatening all kinds of trouble if one of the kids moved or picked up a device. Ultimately we had four control points which led to all kinds of mayhem.</p>\n<p>One thing we noticed was that it was annoying to start a round with the four control points we usually played with. Everyone would have to be by a device to manually start off each timer. A quick googling revealed that <a href=\"https://www.ralfebert.de/tutorials/ios-swift-multipeer-connectivity/\">Multipeer Connectivity is pretty easy to pull off</a>. Another hour of coding and now all of the devices will start off when the first device hits start.</p>\n<p>I do not plan to submit this to the app store. I just don’t want to have to deal with it. The code is under an MIT license, so that you can do whatever you’d like with it.</p>\n<p><strong>To install</strong></p>\n<ul>\n<li>You’ll need <a href=\"https://developer.apple.com/xcode/\">Xcode</a> and an iOS device running iOS 10 or higher.</li>\n<li><a href=\"https://github.com/swilliams/redblue\">Clone or download the code from GitHub</a>.</li>\n<li>Open the <code class=\"language-text\">RedBlue.xcodeproj</code> file in Xcode.</li>\n<li>You may need to adjust the Signing stuff to get it to run on your own devices.</li>\n<li>Connect your device to your Mac.</li>\n<li>From the Product menu, select Run.</li>\n<li>Xcode will build the app and then install it on your device.</li>\n</ul>\n<p><strong>Details</strong></p>\n<ul>\n<li>There are no tests. I should probably fix that. We’ll see.</li>\n<li>Once a round starts there’s no way to end it prematurely other than force-quitting the app. I don’t think that’s a big deal.</li>\n<li>The code could stand to be refactored a bit. I only spent a few hours on it so it’s a little haphazard. <a href=\"https://www.urbandictionary.com/define.php?term=patches%20are%20welcome\">Patches are welcome</a> ;).</li>\n</ul>\n<h3>In the future!</h3>\n<p>I may add other gameplay modes. Some sort of King of the Hill mode may be interesting, or chained control points (point 2 isn’t enabled until point 1 is captured), or any number of other things, but I don’t know if I’ll ever get to that.</p>","frontmatter":{"title":"Red/Blue Game","date":"January 06, 2018"}}},"pageContext":{"slug":"/red-slash-blue-game/","previous":{"fields":{"slug":"/dreamers-and-doers/"},"frontmatter":{"title":"Dreamers and Doers"}},"next":{"fields":{"slug":"/how-i-read-resumes/"},"frontmatter":{"title":"How I Read Resumés"}}}}