{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"6d5e3bc3-8eed-5b5a-89c4-105511bd60d2","excerpt":"I’ve been a fan of podcasts for ages. I listened to  Bill Simmons’s show  since it was called “Eye of the Sports Guy”. I listened to  Dan Benjamin’s  shows…","html":"<p>I’ve been a fan of podcasts for ages. I listened to <a href=\"http://grantland.com/podcasts/bs-report/\">Bill Simmons’s show</a> since it was called “Eye of the Sports Guy”. I listened to <a href=\"http://5by5.tv\">Dan Benjamin’s</a> shows before he made 5by5. About half of my t-shirts are ads for podcasts. So, when some friends asked if I wanted to make a podcast, I jumped at the chance.</p>\n<p>It’s a show about fathers raising their daughters. Our discussions range from the goofy stuff our girls do, to the idea that we need to maintain our masculinity being the sole male in the family, to heavier topics. We’re calling it <a href=\"http://fronttoback.co\">Front to Back</a><sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup>. You can get it on <a href=\"https://itunes.apple.com/us/podcast/front-to-back/id945174610?mt=2\">iTunes here</a>.</p>\n<figure class=\"pull-right\">\n  <a href=\"http://fronttoback.co\"><img alt=\"Front to Back art\" src=\"/images/assets/f2b-art.png\" /></a>\n</figure>\n<p>I’m co-hosting it along with my Internet friends <a href=\"http://jeffmueller.net\">Jeff</a> and <a href=\"http://samdavies.me\">Sam</a>. Right now we are aiming to record every other week. The first episode is a shade over half an hour, which seems like a pretty good duration to me.</p>\n<p>It’s gonna be a learning experience too. Going into this, none of us had ever recorded a podcast. I’ve already learned more than I expected about production and audio editing. Watch this space because I’m going to write about that process too. We’re going to make a bunch of mistakes, but I think we have something here. </p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>Yeah, it references *that*.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"My New Podcast","date":"December 01, 2014"}}},"pageContext":{"slug":"/my-new-podcast/","previous":{"fields":{"slug":"/star-wars-episode-vii-soundtrack-titles/"},"frontmatter":{"title":"Star Wars Episode VII Soundtrack Titles"}},"next":{"fields":{"slug":"/how-to-add-a-noise-gate-in-garageband-10/"},"frontmatter":{"title":"How to Add a Noise Gate in GarageBand 10"}}}}