{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"62eba2b0-3760-5fe9-9bdc-b7f995c7ab14","excerpt":"A few years ago I was at a steakhouse for a company dinner. I had ordered the King of Steaks, a Rib-Eye medium rare and was looking forward to eating it. When I…","html":"<p>A few years ago I was at a steakhouse for a company dinner. I had ordered the King of Steaks, a Rib-Eye medium rare and was looking forward to eating it. When I cut into my steak I saw that it was basically well-done (there was the tiniest sliver of pink left amidst a sea of gray). I flagged the server and said “Um, I ordered this medium-rare…”<sup>1</sup></p>\n<p>Without a moment’s hesitation she apologized, grabbed the plate and went directly back to the kitchen with it. Barely five minutes later she brought back out a piping hot steak that was cooked <em>perfectly</em>. She checked back again a few minutes later to make sure everything was ok (it was).</p>\n<p>Why was this so good? She knew exactly what had happened and knew how to fix it to my satisfaction. There weren’t any games played, just immediate and decisive action.</p>\n<p>I was at a hotel recently and the last day something bad happened that left a sour taste in my mouth. The manager on duty very nice and apologetic. But she asked “What would you like me to do to ‘make it right’?“. I hate that question because I don’t know how to respond. Asking to comp the whole trip would be overboard and unfair. But putting the onus of the decision on me when I’m already under duress only compounds the problem.</p>\n<p>If you’re in the service industry, you need to understand what that means and not make the customer come up with their own solutions. </p>\n<div class=\"footnotes\">\n<p><small>\n1. There could've been a dozen reasons why my steak was overcooked, and it probably wasn't the server's fault, so there's no use in getting angry with her about it. The best part is that I didn't even have time to get angry.\n</small></p>","frontmatter":{"title":"The Best Customer Service","date":"October 15, 2014"}}},"pageContext":{"slug":"/the-best-customer-service/","previous":{"fields":{"slug":"/thoughts-on-swift/"},"frontmatter":{"title":"Thoughts on Swift"}},"next":{"fields":{"slug":"/x-wing-nostalgia/"},"frontmatter":{"title":"X-Wing Nostalgia"}}}}