{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"685d87f8-e990-5ccf-83b8-3172fbfc09a6","excerpt":"I’ve been trying to get my five year old daughter to play on the monkey bars at the park near our house. The problem is that she is scared, deathly afraid of…","html":"<p>I’ve been trying to get my five year old daughter to play on the monkey bars at the park near our house. The problem is that she is scared, deathly afraid of falling, even though I’m right next to her and keep an arm around her waist.</p>\n<p>I’ve sat down and explained to her that she doesn’t have anything to fear, and that I won’t let her fall. I asked her if she wants to overcome her fear of falling. She told me yes, and I told her the only way to overcome her fear is to do what she’s scared of and climb the monkey bars.</p>\n<p>I quit my job the other day. I’ve grown tired and a little depressed from what it’s been for the last 10 years, and want a change. What I think would be great is if I worked at <a href=\"http://github.com\">GitHub</a>; it sounds like an amazing place and I want to be a part of that. I even made a dedicated website to show my enthusiasm.</p>\n<p>But, here’s the problem: I’m scared. I am incredibly afraid of how this will work. What if they tell me to get lost? What if they publicly say that I’m no good? What if they don’t respond at all? What if everyone else on the Internet looks at me and judges me to be worthless and mocks me?</p>\n<p>For the last 24 hours those questions have been keeping me awake and fraying my nerves. I went out for a walk to try to calm down and thought of what I told my daughter: The only way to overcome this fear is to do it. I am still scared to death, but here we go.</p>\n<p><a href=\"http://hiremegithub.com\">Hire me GitHub</a>.</p>","frontmatter":{"title":"Fear of Falling, Fear of Failing, Fear of Rejection","date":"May 14, 2013"}}},"pageContext":{"slug":"/2013/05/14/fear-of-falling-fear-of-failing-fear-of-rejection/","previous":{"fields":{"slug":"/2013/05/06/how-i-finally-understood-functional-programming-with-javascript/"},"frontmatter":{"title":"How I Finally Understood Functional Programming With JavaScript"}},"next":{"fields":{"slug":"/2013/06/07/incentivization/index.html/"},"frontmatter":{"title":"Incentivization"}}}}