{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"f3a83868-db53-56d6-aef8-7d74ad7bea00","excerpt":"Recently, Flickr started to sell photos uploaded by its users marked with the Creative Commons license that allows commercial use . They’ve taken  some   heat…","html":"<figure class=\"center\">\n    <img alt=\"trainwreck\" src=\"/images/assets/trainwreck.jpg\">\n    <figcaption><a href=\"https://flic.kr/p/5ZcYGy\">\"General View of Wreck, I.C.R.R., Farmer City, Ill., Oct. 5, '09\"</a> by <a href=\"https://www.flickr.com/photos/caveman_92223/\">Chuck Coker</a> on Flickr</figcaption>\n</figure>\n<p><a href=\"http://online.wsj.com/articles/fight-over-flickrs-use-of-photos-1416875564\">Recently, Flickr started to sell photos uploaded by its users marked with the Creative Commons license that allows commercial use</a>. They’ve taken <a href=\"http://www.zeldman.com/2014/11/29/flickr-is-about-to-sell-off-your-creative-commons-photos/\">some</a> <a href=\"http://jensimmons.com/writing/i-dont-want-creative-commons-by-to-mean-you-can-rip-me-off\">heat</a> for this. I understand being angry about this sudden change without much notification, but I don’t think it’s terribly suprising that they’re doing this.</p>\n<p>The Creative Commons <a href=\"http://creativecommons.org/licenses/by-nd/4.0/\">license grants them plenty of rights</a>. It says in plain english, “…copy and redistribute the material in any medium or format\nfor any purpose, even commercially… No additional restrictions — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.”</p>\n<p>I used this license for the icon in <a href=\"http://emergencycontacts.org/\">Emergency Contacts</a>. The <a href=\"http://thenounproject.com/term/siren/16374/\">siren in it</a> was created by <a href=\"http://thenounproject.com/canabravatorres/\">Daniel Canabrava Torres</a> and I found it by searching <a href=\"http://thenounproject.com/\">The Noun Project</a>. I attributed him on the website and in the app, and did not pay him for it. I’ve also used it to find photos for on this blog, like the one up top.</p>\n<p>What else does that license mean? Almost anything.</p>\n<p>It means that Coca-Cola could take your photo, make it part of a national campaign, put in on every billboard in the US, and not pay you a nickel. It means that Better Homes And Gardens with its <a href=\"http://en.wikipedia.org/wiki/List_of_magazines_by_circulation#United_States\">7.5 million subscribers</a> could put your photo on the cover, and not pay you anything. It means that I could scrape Flickr and sell your photos myself, and keep all the revenues. As long as you are “attributed” in some way, it’s all legal.</p>\n<p>Flickr requires you to set some kind of license when you upload a photo. By <em>default</em> uses the most restrictive: “All rights reserved” (which precludes anyone but you from selling them), making the Creative Commons option <strong>opt-in</strong>. <sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup> You also have the opportunity to set a license on every photo when you upload it.</p>\n<p>What about other websites? Here’s <a href=\"https://www.facebook.com/legal/terms\">Facebook’s terms</a>:</p>\n<blockquote>\n<p>For content that is covered by intellectual property rights, like photos and videos (IP content), you specifically give us the following permission, subject to your privacy and application settings: you grant us a non-exclusive, transferable, sub-licensable, royalty-free, worldwide license to use any IP content that you post on or in connection with Facebook (IP License). This IP License ends when you delete your IP content or your account unless your content has been shared with others, and they have not deleted it.</p>\n</blockquote>\n<p><a href=\"https://help.instagram.com/478745558852511\">Instagram</a> is nearly identical (no surprise considering they are owned by Facebook):</p>\n<blockquote>\n<p>Instagram does not claim ownership of any Content that you post on or through the Service. Instead, you hereby grant to Instagram a non-exclusive, fully paid and royalty-free, transferable, sub-licensable, worldwide license to use the Content that you post on or through the Service, subject to the Service’s Privacy Policy, available here <a href=\"http://instagram.com/legal/privacy/\">http://instagram.com/legal/privacy/</a>, including but not limited to sections 3 (“Sharing of Your Information”), 4 (“How We Store Your Information”), and 5 (“Your Choices About Your Information”). You can choose who can view your Content and activities, including your photos, as described in the Privacy Policy.</p>\n</blockquote>\n<p><a href=\"https://twitter.com/tos\">Twitter</a> has similar terms too:</p>\n<blockquote>\n<p>You retain your rights to any Content you submit, post or display on or through the Services. By submitting, posting or displaying Content on or through the Services, you grant us a worldwide, non-exclusive, royalty-free license (with the right to sublicense) to use, copy, reproduce, process, adapt, modify, publish, transmit, display and distribute such Content in any and all media or distribution methods (now known or later developed).</p>\n</blockquote>\n<blockquote>\n<p>You agree that this license includes the right for Twitter to provide, promote, and improve the Services and to make Content submitted to or through the Services available to other companies, organizations or individuals who partner with Twitter for the syndication, broadcast, distribution or publication of such Content on other media and services, subject to our terms and conditions for such Content use.</p>\n</blockquote>\n<blockquote>\n<p>Such additional uses by Twitter, or other companies, organizations or individuals who partner with Twitter, may be made with no compensation paid to you with respect to the Content that you submit, post, transmit or otherwise make available through the Services.</p>\n</blockquote>\n<blockquote>\n<p>We may modify or adapt your Content in order to transmit, display or distribute it over computer networks and in various media and/or make changes to your Content as are necessary to conform and adapt that Content to any requirements or limitations of any networks, devices, services or media.</p>\n</blockquote>\n<p>You don’t get any options when you share a photo on Facebook, Instagram, or Twitter. This is far worse. The language is loose enough that it grants them to do just about anything. If they want to sell it, they can, and keep all the proceeds. </p>\n<p>In my opinion, all of these websites should make it clear what they are allowed to do with your photos, when you upload them. Right now, it’s too obscured, and users probably aren’t even aware of this.</p>\n<p>If you really want control, and to maintain the licensing rights<sup id=\"fnref:2\"><a href=\"#fn:2\" rel=\"footnote\">2</a></sup> of your photos on the Internet, you have to host them all yourself. That kind of sucks, but it is the cost of the “social” Internet.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>I created a new Flickr account to confirm this. It was All Rights Reserved by default.</p>\n</li>\n<li class=\"footnote\" id=\"fn:2\">\n  <p>Note that there is absolutely nothing you can do to keep someone else from grabbing your photo and uploading it to some other place and claim ownership. I mean you could sue them, but that's using a grenade to kill a housefly.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"Let's Talk Photo Licensing","date":"December 02, 2014"}}},"pageContext":{"slug":"/2014/12/02/lets-talk-photo-licensing/","previous":{"fields":{"slug":"/2014/12/02/how-to-add-a-noise-gate-in-garageband-10/"},"frontmatter":{"title":"How to Add a Noise Gate in GarageBand 10"}},"next":{"fields":{"slug":"/2014/12/03/things-i-learned-when-making-a-podcast/"},"frontmatter":{"title":"Things I Learned When Making a Podcast"}}}}