{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"2c7b63dd-fa76-5bad-9378-95c2af3e808e","excerpt":"You should listen to  Relay.fm’s  new series on Inquisitive,  “Behind the App” . Myke opens the show with how the iPhone (and smartphones in general) helped…","html":"<p>You should listen to <a href=\"http://www.relay.fm/\">Relay.fm’s</a> new series on Inquisitive, <a href=\"http://www.relay.fm/inquisitive/27\">“Behind the App”</a>. Myke opens the show with how the iPhone (and smartphones in general) helped bring podcasts to a larger audience. He’s absolutely right. </p>\n<p>Before smartphones, you had to sync everything to an iPod with your computer before you could listen to it. For me, this usually happened at home, and if I forgot to plug in my iPod and sync it, I’d go without new episodes for the day; a fate worse than death. Syncing an iPod at the office was usually out of the question. IT policy at the time disallowed connecting personal hardware to company PCs <sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup> and blacklisted many of the sites hosting the audio files anyway.</p>\n<p>I could live with the first issue, but I would go to great lengths to work around the latter one. Even though the experience wasn’t as nice, downloading and listening to a podcast on my work PC was still something. Here’s how:</p>\n<ul>\n<li>SSH into my Linux based web server</li>\n<li><a href=\"http://www.gnu.org/software/wget/manual/wget.html#Overview\"><code class=\"language-text\">wget</code></a> the RSS feed</li>\n<li>Find the link to the newest mp3 file</li>\n<li><code class=\"language-text\">wget</code> the mp3</li>\n<li>Copy it into a folder publicly accessible on my server (this wasn’t blocked by IT)</li>\n<li>Download it locally with my web browser (this was Windows and installing something like wget was also strictly verboten from IT)</li>\n<li>Listen</li>\n</ul>\n<p>Easy peesy lemon squeezey, right?<sup id=\"fnref:2\"><a href=\"#fn:2\" rel=\"footnote\">2</a></sup> Now, if I want to listen to a podcast, I open up <a href=\"https://overcast.fm/\">Overcast</a> and see if there’s anything new. The only thing I have to think about now if I want to download over my cellular connection or not.</p>\n<p>The future is good.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>For <em>very</em> good reason. God only knows what kind of malware you brought along with your external drive...</p>\n</li>\n<li class=\"footnote\" id=\"fn:2\">\n  <p>\"OK... First I'll access the secret military spy satellite that's in a geosynchronous orbit over the Midwest. Then, I'll ID the limo by the vanity plate 'MR. BIGGG' and get his approximate position. Then, I'll reposition the transmitter dish on the remote truck to 17.32 degrees east, hit WESTAR 4 over the Atlantic, bounce the signal down into the Azores, up to COMSAT 6, beam it back to SATCOM 2 transmitter number 137, and down on the dish on the back of Mr. Big's limo... It's almost too easy.\" — <a href=\"http://www.imdb.com/title/tt0105793/\">Garth Algar</a></p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"Podcast Technology","date":"February 18, 2015"}}},"pageContext":{"slug":"/2015/02/18/podcast-technology/","previous":{"fields":{"slug":"/2015/02/02/sympathy-for-the-carroll/"},"frontmatter":{"title":"Sympathy for the Carroll"}},"next":{"fields":{"slug":"/2015/02/24/the-law-doesnt-defend-us-we-defend-the-law/"},"frontmatter":{"title":"The Law Doesn't Defend Us; We Defend the Law"}}}}