{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"1d4abb0f-edef-553d-9bfe-669a7c405c71","excerpt":"Let me tell you about “Jake”. Jake was a colleague of mine and he  loved  to watch TED talks. If you had lunch with him, you were guaranteed to have a…","html":"<p>Let me tell you about “Jake”. Jake was a colleague of mine and he <em>loved</em> to watch TED talks. If you had lunch with him, you were guaranteed to have a stimulating discussion of the blockchain, or AI, or AR &#x26; VR, or some other topic. You’d walk away from it with ideas blasting out of your brain. He had that much sincere passion about all the things that others may have passed over as fads.</p>\n<p>Jake and I used to to get into it because I tended to be more focused on the present and tended to get annoyed with some of the “everything will be better in the future because of [insert-hot-technology]” talk. I do believe that change doesn’t happen through technology alone, but tech can facilitate faster and easier change. Facebook didn’t change the world because it had a neat timeline algorithm but it sure did make it easier for millions of people to bump into each other, for better or for worse. </p>\n<p>Everybody needs to dream a little. The yearning for something new and better is powerful, and can cause all sorts of ideas to hatch. But there is such a thing as too much dreaming. It’s easy to fall in love with tech. It can be <strong>fun</strong> to imagine what it’ll be like when your house responds intelligently to a wave of your hand. But imagining never brought about anything if work didn’t go with it. </p>\n<p>On occasion I’ve been called too pragmatic. I tend to focus on honest to goodness tangible products. I get all kinds of itchy when I hear that someone is an “enthusiast” or “thought leader” on something like cryptocurrencies. Usually they have both of those titles on their LinkedIn profiles. Because there seems to be a lot of <a href=\"https://en.wiktionary.org/wiki/all_hat_and_no_cattle\">hat and no cattle</a> surrounding those hot topics, I tend to roll my eyes a bit and go back to focusing on what’s in front of me.</p>\n<p>This means I have a tendency to be a little behind the curve when something new comes along that I would actually benefit. I’m more of a “doer” than a “dreamer”. But, then I have to play catch-up. I hate playing catch-up. This isn’t scientific but it feels like there is a spectrum here. Some people have their heads totally in the clouds and never get anything done. Some are so focused on the work that they are constantly missing the next big thing. </p>\n<p>The ones who are really dangerous are those who have equal parts dreamer and equal parts doer. One of Alan Kay’s maxims at Xerox PARC was <a href=\"https://en.wikiquote.org/wiki/Alan_Kay\">“The best way to predict the future is to invent it.”</a> Those who can see the trends and how to build businesses and products around them are in the best position to truly bring about change.</p>\n<p>I do think that it is possible to move along that spectrum to an extent. In my job, I’ve been working on dreaming a little more. I should be taking a closer look at some of the things I’ve dismissed because while they may be a little far away from reality right now, they may not be in a year or two, and I don’t want to be on my heels if there’s a big enough shift in the market. I love building cool stuff and goshdarnit, if the blockchain really, truly becomes A Thing, then I want to be there for it. </p>","frontmatter":{"title":"Dreamers and Doers","date":"January 06, 2018"}}},"pageContext":{"slug":"/2018/01/05/dreamers-and-doers/","previous":{"fields":{"slug":"/2017/01/21/race-report-phoenix-rock-n-roll-half-marathon\u001b/"},"frontmatter":{"title":"Race Report — Phoenix Rock 'n Roll Half Marathon"}},"next":{"fields":{"slug":"/2018/01/06/red-slash-blue-game/"},"frontmatter":{"title":"Red/Blue Game"}}}}