{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"8e7cce23-a0b8-5348-88db-3dc1163b7420","excerpt":"","html":"<div><div><div><div><div>\n<p>I'm a bit of a finicky sleeper. I don't like tiny lights on when I try to sleep, and I don't like sounds either. So, when a cricket managed to work its way into my bedroom, it sounded like a marching band playing <a href=\"http://youtu.be/a-7XWhyvIpE?t=59s\">Sousa</a>.</p>\n<p>The first night he started to sing his song at about 11, right when I was falling into a deep sleep. I couldn't find him that night, but I think I made enough of a racket to scare him off, or I just fell back asleep quickly enough to be too unconcsious to hear him again. The next night was different.</p>\n<p>The problem with crickets is that their sound tends to echo and makes it difficult to determine where they are, especially if you have one ear smothered by a pillow. I couldn't tell if he was coming from the bathroom, outside a window, behind the dresser, or somewhere else.</p>\n<p>The second night I took the ninja approach. When he started doing his thing, I crept out of bed,  stood up, and listened. Sounded like it was coming from the bathroom. I took two steps towards forward, and he stopped. I stood absolutely still for a few minutes until he started again. <em>Definitely the bathroom</em>, I thought. I took a few more steps and made it to the entry way of the bathroom before he stopped again. My rudimentary echo-location skills told me it was coming from under the sink. I turned on the light and flung open the doors. I ransacked everything under the sink like a DEA agent searching for cocaine. </p>\n<p>Nothing. Clever girl.</p>\n<p>But, rather than admit defeat, I persevered. I turned the bathroom light off, sat on the ground, and waited. Minutes ticked by with the speed of a handicapped turtle, and I kept waiting. Finally he started to make his sound again. <em>Just to my left!</em> I turned the light on again scanned the ground. <em>There!</em> Right under crack of the door to the commode. </p>\n<p>He was tiny, but with a couple of quick smashes of my sandal he was no more and I flushed that bugger right down the toilet he was hiding next to. I slept soundly that night knowing that my victory was complete.</p>\n</div></div></div></div></div>","frontmatter":{"title":"How I Straight-Up Murdered the Cricket in my Bedroom","date":"August 03, 2013"}}},"pageContext":{"slug":"/2013/08/03/how-i-straight-up-murdered-the-cricket-in-my-bedroom/","previous":{"fields":{"slug":"/2013/06/18/multiplane/"},"frontmatter":{"title":"Multiplane"}},"next":{"fields":{"slug":"/2013/08/03/dont-save-full-paths-to-resources-in-your-ios-app/"},"frontmatter":{"title":"Don't Save Full Paths to Resources in Your iOS app"}}}}