{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"67fc541e-428f-52c3-bac9-f2e21d60c100","excerpt":"","html":"<div><div><div><div><div>\n<p>I usually don't like to commentate on tech news; there are more than enough people doing that already. Let's just let this be a freebie and be done with it, K?</p>\n<p><a href=\"http://www.theverge.com/2013/8/23/4651536/who-will-be-the-next-microsoft-ceo\">Steve Ballmer is retiring from Microsoft within the next year.</a> People are quick to call him out as a \"terrible\" CEO. I think terrible is a little harsh. I wouldn't call him \"great\" or maybe even \"good\". Probably just \"average\" instead.</p>\n<p>Under his watch, profits and revenues went up significantly<sup>1</sup>, <a href=\"http://venturebeat.com/2013/05/20/with-19b-in-revenue-microsofts-server-and-tools-chief-says-hes-just-getting-started-interview/\">their enterprise market grew into a success</a>, and the Xbox became a household name.</p>\n<p>But I think he'll be remembered most of all for all the things that Microsoft squandered or was caught flat-footed for.</p>\n<ul>\n<li>Music. Microsoft introduced <a href=\"http://en.wikipedia.org/wiki/Plays_for_sure\">PlaysForSure</a> and then replaced it with the <a href=\"http://en.wikipedia.org/wiki/Zune\">Zune</a> as Apple was gearing up to launch the iPhone.</li>\n<li>Mobile. After having a headstart and early lead, the iPhone and Android just whalloped them.</li>\n<li>Mobile, again. Tablets are a huge market. Microsoft just took a <a href=\"http://blogs.wsj.com/digits/2013/07/18/microsoft-takes-900-million-writeoff-on-struggling-surface-tablet/\">$900M write-off on theirs</a>, and <a href=\"http://www.informationweek.com/windows/microsoft-news/microsoft-surface-rt-price-slashed-150/240158217\">reduced prices to try to induce demand</a>. This after having a \"tablet\" on the market in 2005. </li>\n<li>Search. Social.</li>\n<li>Online docs. They could still pull this one out though. </li>\n</ul>\n<p>Microsoft's MO has always been to let others establish a market, then enter it and dominate. Under Gates that worked well for them, but under Ballmer things moved too quickly for that strategy. With few exceptions, that never changed.</p>\n<p>Ballmer ultimately did better than some other tech CEOs of his time (Jonathan Schwartz, Carly Fiorina, Léo Apotheker, most Yahoo CEOs), but the unrealized potential and missed opportunities will be his legacy. He did an Ok job all things considered, but Microsoft needs a CEO better than Ok. </p>\n<ol>\n<li>\n<a href=\"http://www.bbc.co.uk/news/business-23815563\">The company has more than tripled revenues and doubled profits under Mr Ballmer's leadership.</a> </li>\n</ol>\n</div></div></div></div></div>","frontmatter":{"title":"The Average CEO","date":"August 24, 2013"}}},"pageContext":{"slug":"/2013/08/24/the-average-ceo/index.html/","previous":{"fields":{"slug":"/2013/08/07/customizing-the-link-color-in-a-uitextview/"},"frontmatter":{"title":"Customizing the Link Color in a UITextView"}},"next":{"fields":{"slug":"/2013/08/27/high-quality-parenting/index.html/"},"frontmatter":{"title":"High Quality Parenting"}}}}