{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"b795052e-bd8d-5884-ab0e-045f35b08658","excerpt":"","html":"<div><div><div><div><div>\n<p>I'm finally starting to realize just some of the <a href=\"http://graphicpeel.com/cssiosicons\">really neat stuff</a> you can accomplish with just HTML and CSS. Recently, I needed to make a simple calendar widget to display what day something occurs. I ended up with this, which I think looks pretty snazzy:Again, no images were used at all. So how does that work? Let's first walk through the HTML:</p>\n<div>\n  <div><pre>&lt;div class=\"calendar\"&gt; \n    &lt;span class=\"month\"&gt;Jul&lt;/span&gt;\n    &lt;span class=\"day\"&gt;31&lt;/span&gt;\n&lt;/div&gt;</pre></div>\n</div>\n<p>Obviously, this doesn't get us much, but it does set the stage for customizing things with CSS. Here's a quick rundown to get the right layout:</p>\n<div>\n  <div><pre>html { font-family: Helvetica, Arial; }\n        .calendar { width: 54px; height: 60px; font-size: 0.8em; background: #eee; border: 1px solid; }\n        .calendar &gt; span { display: block; }\n        .calendar &gt; .month { text-align: right; padding: 2px 5px 2px 0; }\n        .calendar &gt; .day { text-align: center; font-weight: bold; font-size: 2.3em; }</pre></div>\n</div>\n<p>I got the 54 pixel width by playing around until I found something I liked. The background and border are temporary placeholders, just so that we can get a feel for how everything will look. That yields us this:</p>\n<p>That's fairly serviceable, but rather boring. It would make for a decent element on the periodic table, but we're aiming for that high-falutin Web 2.0 stuff. Let's add a little more color to drive home the point.</p>\n<div>\n  <div><pre>.calendar &gt; .month { background: #6086a6; color: #fff; font-weight: bold; }\n    .calendar &gt; .day {  background: #fff; }</pre></div>\n</div>\n<p></p>\n<p>This gives us a little more in the aesthetics department, and a couple of years ago, we'd either have to stop here, or start slicing things up and using images for backgrounds. But now with CSS3, we can add rounded corners, gradients, and a bunch of other great effects. Further, the nice thing about this approach is that it degrades gracefully in older browsers. They don't get the pretty effects, but like I said, that widget is good enough, and it provides them a <em>gentle</em> push to upgrade.</p>\n<p>First, let's round off those sharp corners.</p>\n<div>\n  <div><pre>.calendar { \n        -webkit-border-radius: 5px; -moz-border-radius: 5px; border-radius: 5px; \n    }\n    .calendar &gt; .month { \n        -webkit-border-top-left-radius: 5px; -moz-border-radius-topleft: 5px;\n        -webkit-border-top-right-radius: 5px; -moz-border-radius-topright: 5px;\n        border-top-left-radius: 5px; border-top-right-radius: 5px;\n        }\n    .calendar &gt; .day {\n        -webkit-border-bottom-left-radius:  5px; -moz-border-radius-bottomleft:      5px;\n        -webkit-border-bottom-right-radius: 5px; -moz-border-radius-bottomright:     5px;\n        }</pre></div>\n</div>\n<p>Now, if you aren't familiar with CSS3, you might not know what the \"-webkit\" and \"-moz\" prefixes are. CSS3 still hasn't been completely nailed down, but the browser makers wanted to start implementing features without waiting for the standards committees to finalize everything. So, they added their own implementations. Safari, Chrome, and other webkit based browsers use \"-webkit\". Mozilla based browsers (Firefox) use \"-moz\". Opera uses \"-o\" (and it's omitted here for length, and also because nobody uses Opera). Internet Explorer... <span>sucks</span> doesn't really do CSS3 at this juncture. Technically it uses it's own special filter syntax, and with a little bit of googling, you can find it too.</p>\n<p>Anyways, back to our widget. We have to add the top and bottom radii to the .month and .day elements because their backgrounds will bleed over the calendar rounded corners and look ugly. Additionally, the border doesn't work so great with the rounded corners, so get rid of it. We can do something better than it anyways, the box-shadow.</p>\n<div>\n  <div><pre>.calendar {\n        box-shadow: 0 0 5px #05587e; -moz-box-shadow: 0 0 5px #05587e; \n        -webkit-box-shadow: 0 0 5px #05587e;\n        }</pre></div>\n</div>\n<p>That gives us a nice glowy look all the way around the widget.</p>\n<p>Looking better! But there is still a little more we can do. Let's change the background to a gradient.</p>\n<div>\n  <div><pre>.calendar &gt; .month { text-shadow: 0 1px #000;\n        background: -webkit-gradient(linear, left top, left bottom, from(#acc0d1), to(#6086a6));\n        background: -moz-linear-gradient(top, #acc0d1, #6086a6);\n        }\n                                         \n    .calendar &gt; .day { text-shadow: 0 1px #fff;\n        background: -webkit-gradient(linear, left top, left bottom, from(#405b72), to(#e6e6e6), color-stop(.08,#f9f9f9));\n        background: -moz-linear-gradient(top, #f9f9f9, #e6e6e6);\n        }</pre></div>\n</div>\n<p>This gives us the nicer looking backgrounds. Additionally, the text-shadows make the text feel slightly more 'etched'. It probably isn't something you'd want to use all over the place, but here it looks good.</p>\n<p></p>\n<p>There you have it! With a bit of CSS3, you can really turn up the heat on your HTML, and even ditch the tedium of sizing and uploading gradients.</p>\n<p>I uploaded the whole source to <a href=\"http://github.com/swilliams/CSS3-Calendar-Widget\">github</a>, which might be a little overkill for something this small, but I'm trying to start doing more thing in the public square.</p>\n</div></div></div></div></div>","frontmatter":{"title":"A Fancy Calendar Icon With Just CSS & HTML","date":"July 15, 2010"}}},"pageContext":{"slug":"/2010/07/15/a-fancy-calendar-icon-with-just-css-html/","previous":{"fields":{"slug":"/2010/07/14/development-on-windows/"},"frontmatter":{"title":"Development on Windows"}},"next":{"fields":{"slug":"/2010/07/15/why-i-got-rid-of-my-iphone-3g/index.html/"},"frontmatter":{"title":"Why I Got Rid of My iPhone 3G"}}}}