{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"af7045cc-eff5-55b9-8e2f-5cf5c647af62","excerpt":"Ed Catmull  knows a thing or two about making Great Things. In 2007 he gave a talk at Stanford about how Pixar does their thing. It’s almost an hour long but…","html":"<p><a href=\"http://waltdisneystudios.com/corp/unit/6/bio/53\">Ed Catmull</a> knows a thing or two about making Great Things. In 2007 he gave a talk at Stanford about how Pixar does their thing. It’s almost an hour long but you should watch it.</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 75%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"//www.youtube.com/embed/k2h2lvhzMDc\" frameborder=\"0\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p>Some of the things that resonated with me and are just as applicable in other practices:</p>\n<p>Present work <em>every day</em>. Even if it is incomplete or sucks. Why? It forces collaboration. If everybody is bumping up against each other, ideas will spread. Problems don’t fester either; if someone is struggling on some task for too long it becomes apparent and somebody else can lend a hand if necessary.</p>\n<p>Success hides problems. This might be the biggest one. It’s easy to dismiss problems during times of feast. Catmull also mentioned that they have an open-door policy for everyone and strive to make it safe for <em>everyone</em> to tell the truth. This is hard to do. Even if the CEO’s door is open, rank-and-file employees will simply feel <a href=\"http://www.inc.com/magazine/20080901/how-hard-could-it-be-how-i-learned-to-love-middle-managers.html?partner=fogcreek\">intimidated walking in and stating their mind</a>.</p>\n<p>To solve this, Pixar introduced post-morterms; essentially a discussion after the completion of a project to highlight what worked and what didn’t. These can be annoying, which means that people will game them, even unintentionally. Pixar found that they had to change up the post-morterms every time in order to get real value from them.</p>\n<p>What it boiled down to was that their goal was to create teams of good people that functioned well together. Good people don’t tolerate nonsense. If you give a bad idea to a good group, they’ll fix it, or throw it away and come up with a better one. A group of mediocre people will take a good idea and screw it up. Therefore, hiring the right people, and then managing them is critical.</p>\n<p>Human organziations are inherently unstable and fall over slowly. The fall is slow, but the collapse is quick. The more I experience I get, the more I see people management as a critical role on any project with more than one person. A good project manager constantly takes information from the team and acts on that in order to avoid the fall.</p>","frontmatter":{"title":"Notes From Ed Catmull","date":"May 01, 2014"}}},"pageContext":{"slug":"/2014/05/01/notes-from-ed-catmull/","previous":{"fields":{"slug":"/2014/04/23/monument-valley-is-pretty/"},"frontmatter":{"title":"Monument Valley is Pretty"}},"next":{"fields":{"slug":"/2014/05/06/oh-cool-you-want-to-be-a-web-developer/"},"frontmatter":{"title":"Oh Cool You Want to be a Web Developer?"}}}}