{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"f6facce9-a61c-5dfe-8907-1298e60d3038","excerpt":"Names are hard, especially for a framework or library. A good name is memorable, and can be a shot in the arm in terms of discoverability. Finding a good name…","html":"<p>Names are hard, especially for a framework or library. A good name is memorable, and can be a shot in the arm in terms of discoverability. Finding a good name is nebulous, and too often falls into the I’ll-know-it-when-I-see-it category. But a <em>bad</em> name is easier to define. The biggest sin of bad names is that they are impossible to find answers when you run into questions.</p>\n<p>I don’t like to throw rocks at somebody else’s hard work, but I think it’s been enough time that I can gently criticize the name of the <a href=\"http://prototypejs.org/\">Prototype JavaScript library</a><sup>1</sup>. Why was this a bad name? Well, what do you do when you run into a problem that isn’t quickly found in the official documentation? Search for it on Google. Now, the term <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/prototype\">“prototype” is a core part of the JavaScript language</a>, which meant that every single search result for “prototype X”, “JavaScript prototype X”, “prototype js X” or any other combination only referred to dealing with <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Inheritance_and_the_prototype_chain\">prototypal inheritance in JavaScript</a>.</p>\n<p>You may be the biggest fan of both The Simpsons and Ruby. Don’t name your library “Homer”. Again, what happens if someone runs into a problem when using Homer? They’re going to try to search for “homer fix json serialization” and get a bunch of funnier Simpsons quotes. Your JSON parsing library is never going to be more popular than <a href=\"https://www.youtube.com/watch?v=khSIYmTzt6U\">Mr. Simpson</a>, so please, pick something else.</p>\n<p>Common words aren’t necessarily bad. <a href=\"http://backbonejs.org/\">Backbone</a>, <a href=\"http://underscorejs.org/\">Underscore</a>, <a href=\"http://rubyonrails.org/\">Rails</a>, <a href=\"http://nodejs.org/\">node</a>, and <a href=\"http://expressjs.com/\">express</a> are all fairly common English words, but none of them are common enough to pollute search results. Spend a few minutes searching around before putting together your splash page.</p>\n<div class=\"footnotes\">\n<p><small>\n1. In the war between Prototype and jQuery, I was in the former's camp for a long time. Prototype seemed like magic back in 2006 when I was coding AJAX manually. Searching for jQuery issues was never a problem though.\n</small></p>","frontmatter":{"title":"Naming Your Stuff","date":"July 10, 2014"}}},"pageContext":{"slug":"/naming-your-stuff/","previous":{"fields":{"slug":"/friction-and-teams/"},"frontmatter":{"title":"Friction and Teams"}},"next":{"fields":{"slug":"/podcasts-i-listen-to-july-2014/"},"frontmatter":{"title":"Podcasts I Listen to (July 2014)"}}}}