{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"a7f89cf0-8abc-5293-984c-75e51e29af41","excerpt":"I see a lot of resumés.  We’re a growing company , and  are hiring often , so the rate of resumés that cross my desk has only gone up. I care quite a bit about…","html":"<p>I see a lot of resumés. <a href=\"https://tallwave.com\">We’re a growing company</a>, and <a href=\"https://jobs.lever.co/tallwave.com\">are hiring often</a>, so the rate of resumés that cross my desk has only gone up. I care quite a bit about my team and hire with great care, so I say ‘no’ most of the time. If you wanted to know how to get a leg up on my hiring process, and perhaps others’, here’s how I scan and determine pass/reject on resumés.</p>\n<p>*[Note: this is <strong>my</strong> process. I am not stating it is the best or that it will work in any other situation. This is just how I do it.]*</p>\n<p><strong>Step 1</strong>. Reject the grossly unqualified. These are the people who may very well have applied for the wrong job by accident, or just don’t care and apply to every single job they can find. The most memorable of these was someone who’s closest relevant experience to a senior developer position was that they were a college mascot…</p>\n<p>Also, double check to make sure you find and replace the right strings in your cover letter. “I really want to work at [Some Other Company]!” looks bad on you. Speaking of cover letters:</p>\n<p><strong>Step 2</strong>. Reject those who don’t read the job description. I include a blurb like this on every job description I post: </p>\n<blockquote>\n<p>Do not just send in a resume. Tell us your story. What have you built that makes you proud? How have you demonstrated leadership? What are your aspirations? What are you passionate about? What are you dying to learn next? Share with us the stuff that makes you stand out. This could be something as simple as a well-crafted cover letter, or something public that you had a hand in creating.</p>\n</blockquote>\n<p>You’d be surprised how many people don’t do any of that (or actually, if you’ve ever hired anyone before, you are completely not surprised in the least). If there is nothing but a resume attached, it goes in the reject pile.</p>\n<p>“How can you automatically disqualify people without even reading their names?” you say? Well, in this job, the details matter. If you are the type of person that does not read that, you are not going to do <a href=\"https://tallwave.github.io/guidelines/Quality\">well</a> by our clients, and that is just not gonna fly.</p>\n<p>Those two steps will whittle down a pool of 200 applicants to 20 or so. I want to get that number down to below 10. The next steps are a little more involved. But before that, there are a couple of smaller things to consider.</p>\n<p><strong>How much school stuff should I put include?</strong>. School kinda matters for an entry-level job. The school, your GPA, and if what you studied is related to the job are data points, but not deciding factors. Graduating summa cum laude from MIT is a nice feather in your cap, but it does not guarantee that you are a good software developer. </p>\n<p>Nobody cares about your high school. Seriously. Don’t put it on your resumé.</p>\n<p><strong>Bits and bobs</strong>. Have up to date contact information on there. That includes easy URLs to any social media you feel like sharing. If I’m interested, I’ll try to look you up on LinkedIn. Sometimes it’s easier to glean information there than a resumé.</p>\n<p>Ok, more important stuff now.</p>\n<p><strong>Step 3</strong>. More Hemingway, less Faulkner. I will not be spending more than a few minutes at this stage on your resume. I do not have the time to read your 5000 word treatise on how awesome you are. It is possible to convey your passion for the craft in a couple of paragraphs, I’ve seen it. </p>\n<p>Also, take 5 minutes and do a Google search on the company and position you’re applying for. “I saw that you recently did [some thing] and I love [key component of it]. I’d like to talk about that!” Flattery will get you everywhere, and this is the easiest way to get in the good graces of the person screening resumés.</p>\n<p><strong>Step 4</strong>. Evaluate skills and job history. If I’m hiring a web developer, can you, y’know, develop software for the web? When I’m doing this I’m looking for something that makes you stand out to me. Do your best to make this easy for me. “I designed and built a load balanced RESTful API that scaled to 200,000 sessions” is good. “I took a junior dev under my wing and helped her get a promotion” is great.</p>\n<p>For a senior type position, I’m only going to look about 5 years back on job history or so. The industry changes so quickly, it doesn’t really matter that you were a <a href=\"http://backbonejs.org\">Backbone.js</a> expert if we’re jumping into <a href=\"http://vuejs.org\">Vue</a>. You should still include it for history’s sake, but it should be short.</p>\n<p>For the juniors and entry-level folks, don’t include non-relevant part-time jobs. It’s cool that you worked at Chili’s for 9 months, but putting noise like that on a resumé makes me grumpy. <strong>Note:</strong> If you worked crap jobs to put yourself through school and are proud of that, and you should be, put it in the cover letter.</p>\n<p>If you are changing careers, definitely include that, and make it apparent. Last year I hired someone who got her PhD in physics and after 20 years of that decided to become a developer. She was clearly smart and has been a great addition to the team.</p>\n<p>So, if you do all of that, you’ll very likely make it to a phone screen interview. That’s a whole other post though. But, what about bigger companies? The ones with giant HR departments that have other people phone screen?</p>\n<p>In that scenario, your resumé will very likely be screened by a non-technical person. Someone who may not know that if you can build APIs with <a href=\"https://expressjs.com\">Express</a>, you can do it with <a href=\"https://hapijs.com\">Hapi</a>, and is looking for that magic buzzword and will reject you if it is not there. If you feel like you’re applying to a company like that (and if they have more than a few hundred employees, you probably are), take special care that your resumé has all of the right bullet points and that they are obvious.</p>","frontmatter":{"title":"How I Read Resumés","date":"January 21, 2018"}}},"pageContext":{"slug":"/2018/01/21/how-i-read-resumes/","previous":{"fields":{"slug":"/2018/01/06/red-slash-blue-game/"},"frontmatter":{"title":"Red/Blue Game"}},"next":{"fields":{"slug":"/2018/01/28/book-report-dead-mountain/"},"frontmatter":{"title":"Book Report: Dead Mountain"}}}}