{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"2f31db50-ee31-51d4-ae75-f746043d0fb4","excerpt":"Here’s another interview question you’ll face: “What is something that you’ve struggled with and what have you done to fix it?” I view this differently from…","html":"<p>Here’s another interview question you’ll face: “What is something that you’ve struggled with and what have you done to fix it?” I view this differently from <a href=\"/words/2018/11/18/failure-and-ultimately-fixing-it/\">“What have you failed at?”</a> Because to me this is more of a behavior than a single point in history. </p>\n<p>I struggle with being organized. In my youth, I had a very good memory and could keep a ton of things in my head. This helped out quite a bit in school, but it also allowed me to develop some pretty bad habits: Namely, I never developed a way to keep my crap together. I still have an excellent memory for certain things that don’t matter at all. If you need a Star Wars or a Star Trek reference? I’m your guy. But God help me if you’re depending on me to remember to take the trash out before bed.</p>\n<p>In my 20’s this became a problem and I needed to fix it because I was missing stuff. I started to develop my own system over time. I’ve iterated on it, blown it up, and tried most of the $11.99 Getting Things Done methodologies out there. What I’ve ended up with are some relatively basic tasks that work for me and my broken brain. </p>\n<p>I am religious about my calendar. If it is not on my calendar it does not exist. If it’s on my calendar there is a 99% chance I will attend whatever it is, though there’s the odd occasion where the blast of notifications about pending meetings will be completely missed. <sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup></p>\n<p>I’ve become more diligent about writing things down. I don’t have a perfect system for this yet. I’ve oscillated between pen &#x26; paper, typing on a laptop, and iPad + Pencil. My goal is to have all of my notes from the day tracked in a searchable format. I’ve used <a href=\"https://dayoneapp.com\">Day One</a> for this in the past, but I haven’t been terribly thrilled with some of their design decisions as of late. I’m reconsidering iPad + Pencil since I’ve seen some colleagues do some great stuff with that and <a href=\"https://www.gingerlabs.com\">Notability</a>. </p>\n<p>I use <a href=\"https://www.omnigroup.com/omnifocus/\">OmniFocus</a> in a fairly simplistic way. I keep a few running lists called “Today”, “This Week”, and “This Quarter” where I put all of my todos. These could be “Reply to Jake’s email from the 4th” or “Make a feeding chart for the fish”. I try to find a balance between detail and speed when creating  task names. I will forget what “Reply to Jake” means. Reply where? Text? Email? Slack? If there’s more than one email from Jake I’ll add that detail too. I know I’m only using the tip of the iceberg that OmniFocus provides, but I don’t need any more <em>right now</em>. I’ve tried to go hog wild with automations and shortcuts and all that and I get overwhelmed and then regress even further. I need my task management system to be nearly brainless, otherwise it will fall by the wayside. If it’s more than “unlock phone → tap a couple buttons → type words” then there’s a good chance it won’t be entered. </p>\n<p>I’m also a little wary of the time required to automate task management. Often times I don’t think it balances out to a valuable amount of time saved. And then remembering how to use the automations or shortcuts adds to the cognitive load… leading to a less likelihood of actually getting done.</p>\n<p>Lastly, I am still working on the discipline of starting and ending my work day properly. Ideally I’ll get in to work, review my calendar and outstanding tasks for the day and update everything, and start things off well. And then at the end of the day, close things down by reviewing/entering notes, prepping for tomorrow, and setting things up for success. That’s still not a practice I’ve made into a habit yet, but I’m working on it.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>This is one of the few things where I want MORE and STRONGER notifications than normal.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"What Are You Struggling With?","date":"November 30, 2018"}}},"pageContext":{"slug":"/2018/11/30/what-are-you-struggling-with/","previous":{"fields":{"slug":"/2018/11/21/deciding-when-a-fix-is-worthwhile/"},"frontmatter":{"title":"Deciding When a Fix is Worthwhile"}},"next":{"fields":{"slug":"/2018/12/11/my-recruiting-trick-the-good-the-bad-and-the-middle/"},"frontmatter":{"title":"My Recruiting “Trick” - The Good, The Bad, and The Middle"}}}}