{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"09ab4902-e480-536b-a943-6ef922b58f2d","excerpt":"A couple of weeks ago I bought a  Scion FR-S . It’s my first non-boring car and so far I’m really liking it. To understand why, here’s my car history:  199…","html":"<p>A couple of weeks ago I bought a <a href=\"http://www.scion.com/cars/FR-S/\">Scion FR-S</a>. It’s my first non-boring car and so far I’m really liking it.</p>\n<p>To understand why, here’s my car history: <a href=\"http://www.edmunds.com/ford/ranger/1992/\">1992 Ford Ranger</a>, <a href=\"http://www.edmunds.com/toyota/corolla/1998/\">1998 Toyota Corolla</a>, and <a href=\"http://www.edmunds.com/honda/civic/2005/\">2005 Honda Civic</a>. I learned manual transmission on the Ranger, but otherwise that whole lot didn’t do much to stir up passion in the souls of men.</p>\n<p>Time was coming around to replace the Civic and I was considering something similarly practical, just a little bigger: an Accord or Camry, probably with the V6 option. I’ve never exactly been a gearhead, though I’ve always appreciated a nice piece of engineering when I’d seen it.</p>\n<p>I had been mulling that decision over in my head when I watched a new episode of <a href=\"https://itunes.apple.com/us/tv-season/episode-1/id593555438?i=598468654\">Top Gear</a>. It featured a new Toyota called the GT86. They gave it pretty high praise (which isn’t a given on that show), especially since it had several  traits to get quality performance, but a very economical price. I was intrigued enough to look it up, but couldn’t find it anywhere on Toyota’s website, and moved on.</p>\n<p>(Note, I don’t know why I never bothered to look up its <a href=\"http://www.subaru.com/vehicles/brz/index.html\">Subaru cousin</a>. It just never entered my head. Sometimes I am dumb.)</p>\n<p>That was the end of that until it came up on the <a href=\"http://neutral.fm/\">Neutral podcast</a>. One of the hosts mentioned that the GT86 was released in the US under Toyota’s Scion label, as the FR-S. I pulled over to look it up on my phone, and sure enough, it was there, <em>and</em> was in the same price range as the Accord and Camry.</p>\n<p>Fast forward a few months and I had took one for a test drive. I liked it enough and it had <em>just</em> enough room for a child’s seat in the back to get approval from my [awesome] wife. About a week later we bought it.</p>\n<p>Like I said, it’s non-boring, but what does that mean? Well, first of all, the corners. Oh my, the corners. It has such a low center of gravity that you can just throw it around corners and it’ll hug them like a too tight t-shirt on a fat guy. Next is the control. We picked the automatic model because my wife has never driven stick and wasn’t terribly interested in learning. However it has a “Manual mode” which means that you can use shifters to go up and down in gear, without a clutch. This is much more fun than I thought it would be. It allows you to get a little more zip out of the engine, and hit the throttle for the to get some more power when coming out of a turn.</p>\n<p>Even though the engine is <em>only</em> 200hp, it’s still more than I’ve been used to, meaning it feels faster to me. A friend of mine took me for a drive in his Mustang GT and showed me what acceleration really feels like with a V8 though.</p>\n<p>This is not to say that it is all rainbows and cupcakes. The aforementioned “Manual” shifters are kind of strange. There’s two ways to shift: paddles around the steering wheel, and with the stick itself. The problem with the paddles is that they’re attached to the wheel, and therefore rotate with it. This is annoying when turning and can cause some strange hand contortions to shift. Because of this, I prefer to use the stick to shift the gears, and question the logic of the paddles altogether. You’ll notice that pricier sports cars with paddle shifters attach them to the column, so they don’t rotate. The paddles also mean the cruise control is much further down on the wheel at the 4 o’clock position.</p>\n<p>The rest of the interior is lacking in gizmos that a similarly priced family sedan would have. The FR-S doesn’t have steering wheel audio controls (or anything else), satellite navigation (an option is available), automatic seats, or backup sensors. It does have bluetooth audio though, which is pretty nice (except when your wife borrows it when your phone is in range and starts blaring through the speakers).</p>\n<p>A prior version of me would have cared more about the lack of those things, but I don’t miss them because the car itself is fun enough. I feel like this might very well turn me into a bit of a car guy.</p>\n<p>My wife asked me to articulate why this is a “fun” car, and after thinking about it for a while I think I know why. It’s the exhiliration of taking a turn, feeling the grip on the road as you go around it tightly, and then having your stomach and senses catching up immediately afterwards. Those things aren’t necessarily dangerous, you can do them at low speeds too, but they hit the same points a rollercoaster does. If you like that, then I recommend the FR-S.</p>\n\n  <a class=\"gatsby-resp-image-link\" href=\"/static/87afb56522eba5c9bb02b39432e97ed5/a5ccc/DSC_7895.jpg\" style=\"display: block\" target=\"_blank\" rel=\"noopener\">\n  \n  <span class=\"gatsby-resp-image-wrapper\" style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom: 66.44444444444444%; position: relative; bottom: 0; left: 0; background-image: url(&apos;data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAMBBAX/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/aAAwDAQACEAMQAAABazPYSUSz/8QAGxAAAgIDAQAAAAAAAAAAAAAAAgMAAQQREiH/2gAIAQEAAQUCGljCpcJVbUjqix4Sff/EABYRAQEBAAAAAAAAAAAAAAAAAAAREv/aAAgBAwEBPwGMv//EABYRAQEBAAAAAAAAAAAAAAAAAAAREv/aAAgBAgEBPwGtP//EABoQAAIDAQEAAAAAAAAAAAAAAAABETEyAhL/2gAIAQEABj8Ch9EekWjRss//xAAcEAEAAgEFAAAAAAAAAAAAAAABABGBITFBYdH/2gAIAQEAAT8hQAWw7Y3tnqU1ixiU8nEA3Z//2gAMAwEAAgADAAAAEHvf/8QAFREBAQAAAAAAAAAAAAAAAAAAMRD/2gAIAQMBAT8QBH//xAAWEQEBAQAAAAAAAAAAAAAAAAARADH/2gAIAQIBAT8QTsr/xAAeEAEAAgIBBQAAAAAAAAAAAAABABExQSFRYYGRof/aAAgBAQABPxDXdwcnvEuNegPuIlpQ9kER0uVTOaWkxKKeJ//Z&apos;); background-size: cover; display: block;\">\n      <img class=\"gatsby-resp-image-image\" style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\" alt=\"Scion FR-S\" title=\"\" src=\"/static/87afb56522eba5c9bb02b39432e97ed5/f8fb9/DSC_7895.jpg\" srcset=\"/static/87afb56522eba5c9bb02b39432e97ed5/e8976/DSC_7895.jpg 148w,\n/static/87afb56522eba5c9bb02b39432e97ed5/63df2/DSC_7895.jpg 295w,\n/static/87afb56522eba5c9bb02b39432e97ed5/f8fb9/DSC_7895.jpg 590w,\n/static/87afb56522eba5c9bb02b39432e97ed5/85e3d/DSC_7895.jpg 885w,\n/static/87afb56522eba5c9bb02b39432e97ed5/a5ccc/DSC_7895.jpg 900w\" sizes=\"(max-width: 590px) 100vw, 590px\">\n    </span>\n  </span>\n  \n  </a>\n    \nScion FR-S","frontmatter":{"title":"In Which I Purchased a New Car","date":"April 20, 2013"}}},"pageContext":{"slug":"/2013/04/20/in-which-i-purchased-a-new-car/","previous":{"fields":{"slug":"/2013/03/21/things-i-learned-while-making-a-simple-game-for-my-daughters/"},"frontmatter":{"title":"Things I Learned While Making a Simple Game For My Daughters"}},"next":{"fields":{"slug":"/2013/05/06/how-i-finally-understood-functional-programming-with-javascript/"},"frontmatter":{"title":"How I Finally Understood Functional Programming With JavaScript"}}}}