{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"fd8bc45c-8dda-5916-951d-83eea3ae174f","excerpt":"Some of my friends have shown interest in buying a digital SLR camera. Since I’m known as the guy who has a nice camera setup, they eventually ask my opinion…","html":"<p>Some of my friends have shown interest in buying a digital SLR camera. Since I’m known as the guy who has a nice camera setup, they eventually ask my opinion. Here’s my response.&#x3C;</p>\n<p>Firstly, why do you even want a DSLR?</p>\n<p>Certain people think that getting an “expensive” camera means that they’ll take really good pictures, and look important. The sad truth is that just because you dropped $500 on an entry level DSLR doesn’t mean you will automatically become the next <a href=\"http://en.wikipedia.org/wiki/Henri_Cartier-Bresson\">Henri Cartier-Bresson</a>.</p>\n<p>In fact, you won’t be fooling people who know what they’re doing. I inwardly scoff when I see a pop-up flash spring up on a sunny day, just because the operator is pointing it towards the shade. Yes, I know you’re on full-automatic, don’t try to hide it. You shelled out a lot of money and are not doing anything differently than you would a camera phone.</p>\n<p>Unless you really want to learn about <em>photography</em>, do not buy a DSLR. If you do not understand how things work on a simple level, your pictures will not be any better than with a cheaper point and shoot camera. By simple level I mean understanding about apertures and f-stops, and their relationship with shutter-speed and ISO.</p>\n<p>Rather, if you want something “nice” consider a higher end point and shoot. Canon just announced the <a href=\"http://www.amazon.com/gp/product/B002LITT56?ie=UTF8&amp;tag=thepetzoo-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B002LITT56\">G11</a>, a semi-professional point and shoot in their venerable G line. Many professionals keep these with them as a backup, or quick access camera. They have full manual controls and will allow you to take fantastic photos.</p>\n<p>If you do want to learn about photography, and plan on taking your camera out more often than once every two months, then get whatever is on sale from <a href=\"http://www.amazon.com/gp/product/B002JCSV5I?ie=UTF8&amp;tag=thepetzoo-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B002JCSV5I\">Nikon</a> or <a href=\"http://www.amazon.com/gp/product/B0012YA85A?ie=UTF8&amp;tag=thepetzoo-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0012YA85A\">Canon</a>. They’re both great systems. Just pick one up and see whichever is more comfortable in your hands. I shoot Nikon myself, and love it.</p>\n<p>Additionally, pick up a <a href=\"http://www.amazon.com/gp/product/B00007E7JU?ie=UTF8&amp;tag=thepetzoo-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00007E7JU\">50mm 1.8 lens</a>. Those go for about $100, but have a very shallow depth of field, and will enable you to push the background out of focus, for a dazzling shot.</p>\n<p>Again, most of the time, you do not need a Digital SLR; save some money and be happy with something else.</p>","frontmatter":{"title":"Which Camera","date":"August 20, 2009"}}},"pageContext":{"slug":"/2009/08/20/which-camera/","previous":{"fields":{"slug":"/2009/08/19/2646590/"},"frontmatter":{"title":"Untitled"}},"next":{"fields":{"slug":"/2009/08/20/i-love-steve-nash-even-more/"},"frontmatter":{"title":"I Love Steve Nash Even More"}}}}