{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"f5cde013-b73a-5a51-b5f5-db49304a88e6","excerpt":"Spurred on by a  Twitter conversation , I figured I’d write more about my thoughts here. I’ve always wanted a GOOD photo editor on the iPad, ever since I saw…","html":"<p>Spurred on by a <a href=\"https://twitter.com/swilliams/status/420395505852506112\">Twitter conversation</a>, I figured I’d write more about my thoughts here. I’ve always wanted a GOOD photo editor on the iPad, ever since I saw the <a href=\"https://www.youtube.com/watch?v=6Fk1V5NqoD4&#x26;list=PLPlyGeI5oeICPGwwp4HTdNZkpyP0flmhC\">demo</a> of the very first one. There have been a few contendors, but they’ve all fallen short. </p>\n<p>iPhoto is supposed to be this solution, but the workflow is aggravating. I’d love to take a picture on my iPhone, pull up my iPad and edit that picture on the bigger screen, then send it back to my phone (or elsewhere). But there’s a lag while iCloud syncs, and then somehow I end up with 4 duplicates when I’m done editing, and another lag while iCloud syncs again, <em>sigh</em>.</p>\n<p>I’ve toyed with the idea of doing it myself in my head, but it’d be pretty hard, and time consuming. If anyone is feeling particularly up for a challenge, here’s how I’d do it.</p>\n<p><strong>Pair with a camera.</strong> This is hard. DSLR’s <em>still</em> don’t have built-in wifi, and neither do most point and shoots<sup>1</sup>. But if someone does have the appropriate adapter, it’d be killer. Bonus points for setting up some kind of ad hoc wifi network for a camera to connect to, if that’s even possible.</p>\n<p><strong>Display photos as soon as they are taken.</strong> When I press the shutter, the photo should appear on the iPad within moments. Since photos (espeically RAW) can be huge, this’ll have to be a temporary buffer. If I start to edit a photo, hang onto it, otherwise just keep the last 10 or so around in memory on the iPad. I should be able to swipe through all of the photos in the buffer.</p>\n<p><strong>Let me start editing immediately.</strong> Obviously you wouldn’t need to add the entirety of Photoshop, but I think a certain subset would be great:</p>\n<ul>\n<li>RAW controls (temperature/tint, exposure, blacks, brightness, etc)</li>\n<li>Curves</li>\n<li>Black &#x26; White manipulation</li>\n<li>“Real” filters, based on the above controls. We already have Instagram, and don’t need another way to make a photo look like it was a Polaroid from the 70’s. Heck, let me make my own filters.</li>\n<li>Basic touch-ups, kinda like Lightroom (smooth skin, eye brightnes, etc). Imagine just being able to draw a brightness correction with just your finger.</li>\n</ul>\n<p><strong>Simple export.</strong> This might be a problem on iOS. Don’t draw my ire like iPhoto and it’s syncing woes. Avoid photos.app until the very end when I <em>want</em> to put a picture in there. Maybe have a companion app for OS X and send a photo there directly from the iPad and avoid the photos app altogether (and save space).</p>\n<p>You could whip through that workflow incredibly fast, and not have to fiddle with a mouse and bloated software, or iCloud lag.</p>\n<div class=\"footnotes\">\n1. I think the camera manufacturers have a secret death wish. You can buy a smartphone with a <a href=\"http://www.amazon.com/gp/product/B00COYOAYW/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B00COYOAYW&linkCode=as2&tag=thepetzoo-20\">pretty decent camera, GPS, and wifi built in for $129</a>, but not a <a href=\"http://www.amazon.com/gp/product/B006U49XM6/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=B006U49XM6&linkCode=as2&tag=thepetzoo-20\">$6500 dSLR</a>.\n    \n</div>","frontmatter":{"title":"Please Steal This App Idea","date":"January 06, 2014"}}},"pageContext":{"slug":"/2014/01/06/please-steal-this-app-idea/","previous":{"fields":{"slug":"/2013/12/26/whither-shootsy-or-how-i-tried-and-failed-a-startup/"},"frontmatter":{"title":"Whither Shootsy, or, How I Tried and Failed a Startup"}},"next":{"fields":{"slug":"/2014/01/09/my-computers-through-the-ages/"},"frontmatter":{"title":"My Computers Through the Ages"}}}}