{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"64b59def-4d2c-5d4b-96bc-3a695eb2b4e0","excerpt":"GarageBand is a decent amateur audio editor and is also free. I use it to edit  my podcast , which has worked out ok.  Dealing with audio buzzing or humming can…","html":"<p>GarageBand is a decent amateur audio editor and is also free. I use it to edit <a href=\"http://fronttoback.co\">my podcast</a>, which has worked out ok. </p>\n<p>Dealing with audio buzzing or humming can be a problem. Sometimes this can be <a href=\"http://en.wikipedia.org/wiki/Spill_%28audio%29\">headphone bleed</a>, or ambient noise, or anything. A <a href=\"http://en.wikipedia.org/wiki/Noise_gate\">noise gate</a> can fix that up pretty well if it isn’t too loud<sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup>. What a noise gate does is analyze your audio and mutes any sound that is below a certain volume. GarageBand has this built-in but it is a little hard to find. It’s interface has changed over different versions, so googling around for it often yields out of date information. Here is where it is in version <strong>10</strong>.</p>\n<p>First click this knobby button. </p>\n<figure class=\"center\">\n    <img alt=\"knobby button\" src=\"/images/assets/gb/knob.png\">\n</figure>\n<p>This’ll bring up a panel at the bottom with some additional controls. Click the information “i” button, turn off “Master”, and click “Controls” from the segmented control.</p>\n<figure class=\"center\">\n    <img alt=\"controls\" src=\"/images/assets/gb/controls.png\">\n</figure>\n<p>Finally, you’ll have a checkbox labeled “Noise Gate” in that info side panel. Check it to turn it on, and use the slider to adjust how big of a gate you want.</p>\n<figure class=\"center\">\n    <img alt=\"noise gate\" src=\"/images/assets/gb/noise-gate.png\">\n</figure>\n<p>This will set the gate on the <em>entire</em> track that is selected up in the main UI. You can have different gates for different tracks, but I don’t think you can different ones on a single track in GarageBand.</p>\n<p>Once I scrape together a little more cash I might go out and get <a href=\"https://itunes.apple.com/us/app/logic-pro-x/id634148309?mt=12&#x26;uo=4&#x26;at=11lxUn\">Logic Pro</a>. For now though, GarageBand works well enough.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>Shoutout to <a href=\"https://twitter.com/jmetzendorf\">Jim Metzendorf</a> for helping me out with this.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"How to Add a Noise Gate in GarageBand 10","date":"December 02, 2014"}}},"pageContext":{"slug":"/2014/12/02/how-to-add-a-noise-gate-in-garageband-10/","previous":{"fields":{"slug":"/2014/12/01/my-new-podcast/"},"frontmatter":{"title":"My New Podcast"}},"next":{"fields":{"slug":"/2014/12/02/lets-talk-photo-licensing/"},"frontmatter":{"title":"Let's Talk Photo Licensing"}}}}