{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"4c159d21-6038-5527-b195-b68f56648e0b","excerpt":"","html":"<div><div><div><div><div>\n<p>Sometimes I just do not understand Microsoft. Windows Media Center is a very good DVR/front end, and pound for pound, arguably the best out there right now. It is easy to set up, simple to use, and aesthetically pleasing. And Microsoft claims that it is an important part in their \"living room experience,\" yet they have barely done anything to support it.</p>  <p>Media Center is basically the exact same thing that was introduced back in 2003. Yes the UI has been updated, and some things have been added, but the main selling points are the same. It's seen about the same level of commitment as Vista's \"Ultimate Extras.\"</p>  <p>What could be done to help right the ship? Firstly is the whole \"Internet TV\" thing. <a href=\"http://www.hulu.com\">Hulu.com</a> is awesome, and would be a killer feature if it were built into Media Center. <a href=\"http://www.netflix.com/WatchNow\">Netflix's Watch Instantly</a> is similar, and already has a <a href=\"http://www.anpark.com/Software.aspx\">3rd Party plugin</a>, but should be bought or re-created in-house.</p>  <p>The second is to focus on one product. The truly amazing thing is just how many separate technologies Microsoft is developing that do the same thing. <a href=\"http://www.msntv.com\">MSN TV</a> is a set top box designed for streaming television over the Internet. <a href=\"http://www.microsoftmediaroom.com\">Media Room</a> has nearly the same feature set as Media Center, and a confusing name to boot. Has anybody even <em>heard</em> of these products? </p>  <p>Additionally, they need to move Media Center to the living room. The Xbox is just too hot and loud, and Extenders are still poorly designed and ugly. If Microsoft could release a set-top box that functioned as a complete Media Center, without the need for a PC, they would have a killer product. Give it a modest hard drive (say 80 gigs) with the option to stream to and from a networked PC. Give it DVR functionality, Flickr, Hulu, Netflix, Joost (maybe), YouTube, and Rhapsody or a similar music streaming service. Dump the worthless and clumsy \"stores\" that are currently offered: MovieLink, CinemaNow, etc, and tie it into the Xbox Live store. Sell it for $250 - $300 and you'd have an amazing product that would sell very well if marketed properly. I'd buy one anyway.</p>  <p>Of course, the cynic in me sees this happening instead: someone (probably Apple, since they've already done it, several times) swooping in and releasing that product and stealing their lunch. Microsoft tries to do something similar, but can't keep up (eg. Zune) and fails for several years before pulling the plug. </p>\n</div></div></div></div></div>","frontmatter":{"title":"Languishing","date":"July 08, 2008"}}},"pageContext":{"slug":"/2008/07/08/languishing/index.html/","previous":{"fields":{"slug":"/2008/03/11/one-of-my-favorite-quotes/index.html/"},"frontmatter":{"title":"One of my favorite quotes"}},"next":{"fields":{"slug":"/2008/09/02/recipe-mediterranean-quesadilla/index.html/"},"frontmatter":{"title":"Recipe: Mediterranean Quesadilla"}}}}