{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"9042c9b8-59c6-57e5-b261-6f1e4288111f","excerpt":"I tend to function better when I have specific goals. As part of improving my overall health I started to take up running back in mid 2015, and got a little…","html":"<p>I tend to function better when I have specific goals. As part of improving my overall health I started to take up running back in mid 2015, and got a little more serious in the early parts of 2016. In a fit of pique I decided to sign up to run the 2017 Rock and Roll Marathon in Phoenix. I’d never come close to running 13 miles before, so the prospect scared me a little bit.</p>\n<p><strong>Training</strong></p>\n<p>So, I started to actually train, even though it was months and months away. I stumbled upon Hal Higdon’s training programs, liked what I saw and started to do a mix of the <a href=\"http://www.halhigdon.com/training/51131/Half-Marathon-Novice-1-Training-Program\">Novice 1</a> and <a href=\"http://www.halhigdon.com/training/51312/Half-Marathon-Novice-2-Training-Program\">2</a> programs.</p>\n<p>I was averaging about 15 miles per week running before summer hit. Then temperatures were averaging mid 90’s even at 5am. It wasn’t even a particularly dry heat this go around with the occasional 50% humidity. My mileage tapered off to below 10 per week, but the race was in January, so I knew I could pick it back up again.</p>\n<p>As fall wore on temperatures finally dipped back down below furnace levels and I started going on longer runs. I was ahead of the training schedule and decided to give the full 13.1 miles a shot on December 17, and got a time of 2:18:19. Not bad. I originally had goals of running it under 2 hours, but I realized that I was just not that fast, and was ok with it.</p>\n<p>One other big training run was on the <a href=\"https://hikearizona.com/decoder.php?ZTN=737\">Charles M. Christiansen trail</a>, a 10.7 hiking trail with some relatively steep spots. A couple spots on the trail weren’t very well marked, so it ended up being 11.5 miles… I don’t do a ton of trail running, so that was a fun little experience.</p>\n<p><strong>The Race</strong></p>\n<p>Eventually January 15, 2017 rolled around. The morning of, I wasn’t sure what to have for breakfast. I usually eat some mix of breakfast sausage and eggs for protein, but it didn’t feel like the right choice to have that grease rolling around in my stomach. I ended up going to my <a href=\"http://www.chompies.com/bakery-and-bagels\">favorite bagel shop</a> and getting a bagel, cream cheese, and lox. It was delicious.</p>\n<p>In Tempe, I found some parking<sup id=\"fnref:1\"><a href=\"#fn:1\" rel=\"footnote\">1</a></sup>, stood in line for 20 minutes to use the bathroom, and made it to my corral as the first starters got going. When I registered, I’d estimated my finishing time to be 2:20, which placed me right in the middle of the pack.</p>\n<p>Eventually we were off! I knew pacing was important and tried to keep a stable one despite the nerves and all the people. I found myself passing a lot of other racers at the start. I checked my watch a few times and my heart rate was fine, so I kept it up.</p>\n<p>My goal going in was to be a little faster than my December run. I was aiming for 2:15. A few miles in I saw a the 2:15 pacer. She was easy to spot because she was holding a tall sign with “2:15” on it. My pace put me ahead of her and I found myself passing more people.</p>\n<p>I was feeling good and enjoying the weather. Rain had been predicted, but never materialized, for which I was grateful. Temperature was about 50 degrees with 70% humidity. I was sweating a bit, but not too badly. I started to keep an eye open for the 2:10 pacer. </p>\n<p>I kept up my pace and was still passing people and eventually hit the halfway mark. I had been listening to a podcast and decided to switch it over to my running playlist. <a href=\"https://raceroster.com/events/2017/10542/the-wicked-marathonhalf-marathon4-mile-and-the-spooky-kids-sprint\">Let it Out</a> by Switchfoot kicked in and I felt energized. My pace crept up a bit, but I was still feeling pretty good.</p>\n<p>The race had water and/or gatorade stations every mile or so I didn’t bring an additional bottle. Grabbing a cup of water while jogging and drinking it is tricky, but I got it to work.</p>\n<p>The course also had a number of portapotties on the course, should you need that. I tend to hyrdate a lot and need to pee on long runs. The portapotties all had decently sized lines at the first few miles, and thinned out in the latter ones. Around mile 8 I decided to use one, thinking it was available. But, it was locked and in use. I jogged around a bit not wanting to get cold. It felt like hours were ticking by while I waited. In reality it was probably only 30 seconds, but I grew impatient and got back in the race.</p>\n<p>Food is also a factor for my long runs. I usually bring a granola bar with me and eat it piece by piece after 8 miles. It’s a good 240 calorie boost after burning 800. I had one in my pocket, but never even reached for it. I’ve always believed that bagels have magical powers and this proved it because I wasn’t even a bit hungry at all during the whole race.</p>\n<p>At mile 9 was The Hill. I’d heard about it from people who had run the course in the past and how hard The Hill was. I got to it and saw that a lot of people were slowing down. By a lot. </p>\n<p>The Hill was not that steep. Come on people.</p>\n<p>Total elevation change on the race is 155ish feet, with this hill making up a big part of it, which is practially nothing. My training on the long trail was significantly harder to run. I kept my pace a cruised up, again passing a lot of people. The ‘fun’ part of the course is that you turn around just past the top of the hill and go right back down. At the top there was a pretty awesome drum and percussion band going to town. That plus a little downhill were when I started to go faster. I passed quite a few people going down. Had it been longer or steeper I would’ve had to slow down, but my quads were doing well and the footing was fine.</p>\n<p>I did start to get a little tired in mile 11. I was ready to be done with the race by that point. I think the humidity was sapping me by then. I grabbed a cup of water and downed it and kept moving. </p>\n<p>This whole time I never saw the 2:10 pacer. I was a little bummed that I couldn’t even see him/her, but assumed they were just around the next corner and I wasn’t that far behind.</p>\n<p>Mile 12 hit and I was re-energized again. One more mile to go! I checked my watch and it was right around 1:53. Holy crap. Under 2 hours was still out, but I realized I could blow past that goal of 2:15. The 2:10 pacer must’ve not been holding a sign or I just missed it. I turned up the juice and ran hard.</p>\n<p>The last half mile is over a bridge and I was passing people left and right. I wanted start shouting “It’s almost over, why aren’t you running?” but didn’t. I got around the last corner and saw my wife, kids, and mother cheering me on, which was great. I jumped on the last timing mat and started to make my way through the mass of finishers. The funny thing about the finishing area was that it was filled with all the sponsors handing out chocolate milk, sports drinks, bananas, etc. If I ate/drank all the stuff there I would’ve easily thrown up.</p>\n<p>I found out later that that my official time was 2:02:57, which was far faster than I was expecting to run. </p>\n<p><strong>After/Next</strong></p>\n<p>I wasn’t particularly tired or sore after the race. However, the stiffness and soreness did set after sitting in the car for the 30 minute drive home. It wasn’t too bad though.</p>\n<p>Knowing myself, sometimes when I hit a goal I fall back into bad habits. I don’t want that to happen this time. So, <a href=\"https://raceroster.com/events/2017/10542/the-wicked-marathonhalf-marathon4-mile-and-the-spooky-kids-sprint\">I signed up to run a <em>full</em> marathon in October</a>. 26 miles to run seems insane, but I’ll be sure to train properly and see how it goes.</p>\n<div class=\"footnotes\">\n  <ol>\n    <li class=\"footnote\" id=\"fn:1\">\n  <p>Thousands of people were there so finding parking took some doing.</p>\n</li>\n  </ol>\n</div>","frontmatter":{"title":"Race Report — Phoenix Rock 'n Roll Half Marathon","date":"January 28, 2017"}}},"pageContext":{"slug":"/2017/01/21/race-report-phoenix-rock-n-roll-half-marathon\u001b/","previous":{"fields":{"slug":"/2016/09/07/google-oauth-ember-hapi/"},"frontmatter":{"title":"Google OAuth, Ember, Hapi"}},"next":{"fields":{"slug":"/2018/01/05/dreamers-and-doers/"},"frontmatter":{"title":"Dreamers and Doers"}}}}