{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"1e98d045-3bfe-588c-b8cf-f33aec4ef8ce","excerpt":"With news of the  heartbleed vulnerability  I’ve taken the  paranoid  precautionary measure of changing all my passwords. I have over 200 logins in my…","html":"<p>With news of the <a href=\"http://heartbleed.com/\">heartbleed vulnerability</a> I’ve taken the <strike>paranoid</strike> precautionary measure of changing all my passwords. I have over 200 logins in my <a href=\"https://agilebits.com/onepassword\">1Password</a><sup>1</sup> library, so I’ve seen just about every kind of password change process imaginable over the last day or two. My conclusion is that there are a lot of <strong>terrible</strong> implementations of this process.</p>\n<p>Security conflicts with convenience, and changing passwords is never convenient. But there are ways to at least make it quick. Here’s what I expect when I got to a site to change my password:</p>\n<ol>\n<li>Sign in.</li>\n<li>Click something like ‘Settings’, ‘Account’, or ‘Profile’. Ideally, there should only be one of those on the page to avoid guessing.</li>\n<li>Have the word ‘password’ on that Settings page. Be it a button, link, or inline form, just make it easy to find.</li>\n<li>If I need to enter my old password first, make it the first field.</li>\n<li>Display some kind of notification that my change was successful.</li>\n<li>Optionally, send me an email telling me it changed, just in case a bad guy did it.</li>\n</ol>\n<p>That’s not so bad right? This has been the standard way of doing things ever since <a href=\"http://en.wikipedia.org/wiki/Cgi-bin\">cgi-bin</a> was a thing. But so many websites get it wrong.</p>\n<ul>\n<li>First of all, <em>have</em> a Change Password form. More than a couple sites I went to don’t have one and rely on you to do the Reset My Password dance. This means I have to sign out, go back to the sign in page, click the reset link, enter my email, wait for the email, open the email, click the link in the email, then finally enter a new password. Shame on you if you make me do this. Shame.</li>\n<li>Don’t restrict password length. 1Password let’s me create a 50 character password, yet I’d say at least 40% of the sites I went to couldn’t handle a password that long.</li>\n<li>If you have to restrict length for some reason, tell me exactly what that maximum is.</li>\n</ul>\n<figure>\n    <img alt=\"Password WTF\" src=\"/images/assets/password-wtf.png\" />\n</figure>\n<ul>\n<li>Don’t restrict what characters I can use. There is no technical reason I shouldn’t be able to use spaces or symbols in a password.</li>\n<li>Don’t restrict copy/paste in the password field. Paypal was the only one I saw that did this, and it boggles my mind. A random, complex password is going to be more secure than one I can easily type in (which can be <a href=\"http://en.wikipedia.org/wiki/Rainbow_tables\">cracked quickly</a>). Don’t actively prevent me from trying to make my financial data secure!</li>\n</ul>\n<p>Security already has its own set of barriers, and a certain subset of people will never take it seriously. As a web developer, it is entirely up to you to keep that subset from growing in size.</p>\n<div class=\"footnotes\">\n1. You really, really, really, really, really, really, should use it too, or a similar product.\n</div>","frontmatter":{"title":"Changing Your Password","date":"April 11, 2014"}}},"pageContext":{"slug":"/2014/04/11/changing-your-password/","previous":{"fields":{"slug":"/2014/03/06/my-computers-through-the-ages-part-iii/"},"frontmatter":{"title":"My Computers Through the Ages Part III"}},"next":{"fields":{"slug":"/2014/04/23/monument-valley-is-pretty/"},"frontmatter":{"title":"Monument Valley is Pretty"}}}}