{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"9737b81a-f873-5a78-a309-e86e5d85dd6a","excerpt":"Great Customer Service is not dead ! When I was doing freelance/independent work I used  Harvest’s  Solo plan to track my time and invoice clients. It was…","html":"<p><a href=\"http://blog.swilliams.me/2014/10/15/the-best-customer-service/\">Great Customer Service is not dead</a>! When I was doing freelance/independent work I used <a href=\"https://www.getharvest.com/\">Harvest’s</a> Solo plan to track my time and invoice clients. It was affordable for a single person and wasn’t over-engineered. Since it was cheaper in the long run I paid for a yearly plan and renewed each time it came up. I would’ve recommended them to anyone in a similar position. Now I’ll recommend them even more heavily. </p>\n<p>A few months ago I took a full-time position and just didn’t need the paid account any more. I couldn’t figure out how to downgrade though so I sent a request to their customer service. The page told me to expect a response within an hour. Within 5 minutes I got a response from Jennifer telling me that my plan had been downgraded to the free one, AND they refunded the prorated amount for the remainder of the year back to me.</p>\n<p>Getting a refund wasn’t even on my radar. I was perfectly happy with keeping the paid plan and just not renewing it when the time came. What I love about this is that Harvest didn’t waffle around the issue for a long time only to end up doing the bare minimum to get the customer to go away. They were fast, proactive, and exceeded expectations. </p>\n<p>That’s how you do customer service.</p>","frontmatter":{"title":"Great Moments in Customer Service","date":"July 24, 2015"}}},"pageContext":{"slug":"/2015/07/24/great-moments-in-customer-service/","previous":{"fields":{"slug":"/2015/07/02/watchkit-connectivity-and-file-transfers/"},"frontmatter":{"title":"WatchKit Connectivity and File Transfers"}},"next":{"fields":{"slug":"/2015/08/09/finding-the-last-photo-taken/"},"frontmatter":{"title":"Finding the Last Photo Taken"}}}}