{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"1d4d67b2-a4a3-5b7d-a849-47bcf30e740e","excerpt":"Squarespace is a popular service to host a website or blog. You might have seen their  Super Bowl commercial  or heard about them on one of the hundred podcasts…","html":"<p>Squarespace is a popular service to host a website or blog. You might have seen their <a href=\"http://www.youtube.com/watch?v=S0Or1f_RxKQ\">Super Bowl commercial</a> or heard about them on one of the hundred podcasts they sponsor. I signed up about a year and a half ago and used it as my main blog. I’ve decided to move away and use <a href=\"http://octopress.org\">Octopress</a> to host my blog on <a href=\"http://octopress.org/\">GitHub Pages</a> instead.</p>\n<p>Why? Well, for starters, it’s slow to use. I think it’s a byproduct of the way they organized their <a href=\"http://en.wikipedia.org/wiki/Single-page_application\">single-page application</a> architecture. I find myself having to wait for things to open in modal windows, or to load another menu. </p>\n<p>The layout tools are bad. If all you do is write text and link to stuff, this doesn’t matter. Sometimes I like to have <a href=\"/words/2014/01/26/demystifying-ruby-dsls\">in depth coding posts</a> that have multiple blocks of code within them. This is incredibly painful to do with the Squarespace layout tools. Here’s the process:</p>\n<ol>\n<li>Hover over an existing text block.</li>\n<li>Click the appropriate ”+” button.</li>\n<li>Scroll down to find the “CODE” button.</li>\n<li>Paste in the code (after making sure the indentation is correct)</li>\n<li>Go to step 1 and this time, select Markdown.</li>\n<li>Rinse and repeat for <em>every</em> block and image you want.</li>\n</ol>\n<p>What you see is <em>definitely not</em> what you get. Sizing images to align to the left or right of a paragraph is awful. For some reason, the editing font on the admin page is different than the one on the actual site. This means that even if everything lines up on the admin page, it might not on the live site. Fixing this is tedious. Again, due to the single-pagedness of the admin site, you can’t easiliy open the preview in a new tab or window (‘Open in new page’ does nothing). You need to open a brand new browser window, navigate to your admin site, then click on the preview button there.</p>\n<p>Saving a post in the editor closes the modal that contains it. This means that the workflow for making any kind of adjustment is:</p>\n<ol>\n<li>Do the thing above to get a second window open to look at the preview.</li>\n<li>Click the post in the first window to edit.</li>\n<li>Wait a second.</li>\n<li>Find the typo to fix. This is extra fun if you have multiple blocks of text.</li>\n<li>Fix the typo and hit save. (Modal closes)</li>\n<li>Switch over to the preview in the second window and refresh.</li>\n<li>If it’s not right, repeat steps 2-6 until it is.</li>\n</ol>\n<p>All of this for about $100/year (or more).</p>\n<p>Octopress is a static site generator that is aimed at developers. If you don’t know <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a>, <a href=\"http://git-scm.com/\">git</a>, as well as HTML + CSS consider something else. However, since I am familiar with all of those, it works for me.</p>\n<p>The problem is exporting my content from Squarespace. The only export option available is one for <a href=\"http://wordpress.org/\">Wordpress</a>, which dumps everything into an XML file. Since I’m not using Wordpress, this didn’t work for me. My blog has been quite the sojourner, created orginally on Wordpress, then to Posterous (lol), and finally Squarespace. It’s accumulated a bit of cruft. For some reason, older posts did not export properly; if they contained an image and text, the text was deleted.</p>\n<p>After some fiddling, I put together a <a href=\"https://github.com/swilliams/squarespace-exporter\">script</a> that would walk each post on the blog, download everything and then move onto the next. I did run into some gotchas though:</p>\n<ul>\n<li>Some of the older images were named “#img.jpg”. I ended up <a href=\"https://github.com/swilliams/squarespace-exporter/blob/master/script.rb#L151\">generating</a> a random string for the filename and removing the hashtag.</li>\n<li><code class=\"language-text\">&lt;img&gt;</code> tags used a <code class=\"language-text\">data-src</code> attribute instead of a standard <code class=\"language-text\">src</code> attribute. <a href=\"https://github.com/swilliams/squarespace-exporter/blob/master/script.rb#L181\">The fix was to rename the attribute</a>.</li>\n<li>There was a veritable boatload of extra markup and attributes on each post, which made things look weird. I ended up parsing the entire HTML of each post and <a href=\"https://github.com/swilliams/squarespace-exporter/blob/master/script.rb#L223\">stripping</a> out all the unnecessary stuff.</li>\n</ul>\n<p>There are still some issues that I’ll need to address on a case by case basis, but it’s a good 80% solution right now.</p>\n<figure>\n    <img src=\"/images/assets/octopress.png\" alt=\"Octopress\" />\n</figure>\n<p>I like Octopress because it is fast, easy for me to manage, and keeps my content in a simple (and portable) format. I just hope that this will last me for a while. It doesn’t do nearly as many things as Squarespace, but most of those I don’t need.</p>","frontmatter":{"title":"Migrating from Squarespace","date":"March 05, 2014"}}},"pageContext":{"slug":"/migrating-from-squarespace/","previous":{"fields":{"slug":"/demystifying-ruby-dsls-part-2/"},"frontmatter":{"title":"Demystifying Ruby DSLs — Part 2"}},"next":{"fields":{"slug":"/my-computers-through-the-ages-part-iii/"},"frontmatter":{"title":"My Computers Through the Ages Part III"}}}}