{"data":{"site":{"siteMetadata":{"title":"A Blog","author":"Scott Williams"}},"markdownRemark":{"id":"7fb78133-d04c-5535-b239-76e25a7c189d","excerpt":"","html":"<div><div><div><div><div>\n<div><em>And now, here's my arbitrary and subjective look at Spotify and Rdio.</em></div>\n<p>Spotify has now launched in the US. This is good news. I had originally checked it out a year ago using a proxy to pretend to be British<sup>1</sup>, but it was too much of a hassle to keep maintaining the proxy connection to be worthwhile. Fortunately around the same time I discovered Rdio, and have been a happy subscriber with them ever since.</p>\n<div>But now, there's a choice! Since I had that other account, I was able to just switch my location and jump right back into Spotify. So, let's do a little compare and contrast between the two services. I have the Rdio Unlimited plan ($10/month) and since I'm just sampling Spotify, using their limited free plan.</div>\n<p></p>\n<div><strong>Ads</strong></div>\n<div>Rdio offers no free plan, but with Spotify you can get 10 hours of music per month with ads, both as banners in the app and audible ones between songs. The ads are pretty obnoxious, but that's what you get for free. Some people are actually complaining about this. I just want to make sure that I'm understanding this one: You want a music service that gives you unlimited access to music, for free, with no advertisements at all, right? Why not ask for a pony that craps skittle flavored gold too?</div>\n<p></p>\n<div>If I do switch it'll be to a paid Spotify plan, so ads are a moot point with me.</div>\n<p></p>\n<div><strong>Music Selection</strong></div>\n<div>Both seem to be pretty comparable. There are some gaps (both their Calexico selections are far too weak), but my tastes are well represented.</div>\n<p></p>\n<div>Rdio is better at finding new music. They have a Recommended page that suggests music that you might like based on your listening habits, but I've never had much luck with it. What I do find useful is Rdio's New Releases section. It lists all the albums that are new to Rdio (new releases, re-issues, or just new to the service).</div>\n<div></div>\n<div>Most of the stuff I just don't care for, but there's usually a couple of things worth listening to each week.</div>\n<div>Spotify does have a \"What's New\" page, but it isn't nearly as good. It lists only 8 albums at a time, and those don't seem to have a clearly defined meaning of \"new\": there's a Brittney Spears album there that's been out for a while (I think), I don't know if it's new to Spotify, or just \"Hot\". </div>\n<p></p>\n<div>Rdio also has a radio utility, which will play random songs based on what is on your current screen, and other criteria you can provide. It's no Pandora, but works as a decent Party Shuffle if that's what you're looking for.</div>\n<p></p>\n<div><strong>Library Management</strong></div>\n<div>Spotify's playlist implementation is much better than Rdio's, period. Unless I'm missing something, you can only add or remove songs one at a time with Rdio. This is downright painful.</div>\n<div></div>\n<div>Spotify presents lists as a standard list view, meaning you can select multiple things, and then do whatever you want with them.</div>\n<div><strong></strong></div>\n<p></p>\n<div>Neither of them support complex or \"Smart\" playlists like can be found in iTunes. This is really too bad, since it's a powerful feature<sup>2</sup>.</div>\n<p></p>\n<div>Additionally, Spotify has a \"favorites\" functionality. You can click the star icon next to a song, which will add it to the special Starred list. Rdio doesn't have anything like this. I ended up creating a playlist in Rdio called \"Neato\" and manually added songs to that, which isn't nearly as nice.</div>\n<p></p>\n<div>Both apps will look at your local music and add it to the library if you'd like that (I don't), although Spotify keeps things a little cleaner by having a separate Local Files list in their sidebar.</div>\n<p></p>\n<div>Spotify's concept of a Library is: \"Music you've starred, imported, bought, or added to a playlist\". This is a problem for me. If I like an album, I want to add it to my library. The only way to do this is to add it to a playlist or star it. I ended up creating an Everything playlist and dropping stuff in there, which doesn't feel quite right. Rdio's library (called Collection) is just a big bucket. You can click on a song or album and add it to your Collection. This makes more sense to me, and seems more analogous to a traditional CD collection.</div>\n<p></p>\n<div>Rdio will kind of give you metrics on what you have listened to. In your collection, there are blobs of artists (or songs). The bigger the blob, the more you've listened to that artist (or song). Hovering over a blob will give you an exact number, but that's about it. I'd prefer something like iTunes's actual playcount on each song.</div>\n<div><strong></strong></div>\n<div>It also is not all that representative; I saw that The Clash's Sandinista! was available, but that's a big triple album; each run through counts as 36 listens. It's a good album, but I've only listened to it 3 times in the last year and it is rather prominent on my Most Played list.</div>\n<p></p>\n<div><strong>UX</strong></div>\n<div>You can do more with Spotify, but I found Rdio's interface to be more intuitive. Both apps support creating a queue of songs to serve as a running playlist. Spotify's has some weird behavior associated with it. If you are on track 3 of an album, and then add another to the queue, that new album will start as soon as the current song has ended. I would expect it to queue up at the end of the list, as Rdio's does.</div>\n<div></div>\n<div>And I have no idea what's going on here. I added the Bon Iver album, and two others after it, but it is still showing up at the bottom of the queue, with no way to remove it. I don't know what will happen once I reach the end of The National album that's queued up.</div>\n<p></p>\n<div><em>Update - this has taken a while to write, so my queue finally worked its way down to those repeated Bon Iver tracks, and played them again... Still don't know how that happened.</em></div>\n<p></p>\n<div><strong>Social</strong></div>\n<div>Both services have standard Twitter and Facebook integration. Nothing special here. </div>\n<p></p>\n<div>One thing that Rdio does have over Spotify is that it supports embedding a little widget in a web page that will play a clip of a song. This is pretty handy to share stuff with non-Rdio subscribers. The only wish I have was that it would play the whole song, like the late lamented Lala, but I doubt they'd ever be able to wrangle the content providers into allowing that. Spotify has something similar, but requires listeners to have Spotify accounts to listen in, and isn't embeddable.</div>\n<div></div>\n<div>Rdio also has its own social network built into it. You can follow people and see what they listen to. Of course, this is only as useful as the number of people you know with similar tastes as yourself.</div>\n<p></p>\n<div>Both services have desktop apps for Mac OS X. Both support the media keys for play/pause, next, and previous. Rdio uses Flash for it's rights management streaming, but nowadays bundles it with the app (like Chrome). I don't have Flash installed system wide, so this is a nice touch. It doesn't look like Spotify is based on Flash tech, or at least, I couldn't find any in the Package Contents.</div>\n<p></p>\n<div><strong>Conclusion</strong></div>\n<div>I really like Spotify's playlist management, but I think I like everything else in Rdio more. I can live with (and have for the past year) Rdio's crummy playlist support, but I don't know if I'd be alright with Spotify's UI quirks. I think I'll hang on to the free version of Spotify to see if they can iron out some of the UI issues, but I'm not going to be canceling Rdio any time soon.</div>\n<div>\n<p></p>\n<p></p>\n<div><span><span>Notes</span></span></div>\n<div><span><span>1. I found the ads for \"Crisps\" delivered in \"proper English\" to be downright delightful.</span></span></div>\n</div>\n<p></p>\n<div><span><span>2. For example. I have a playlist in iTunes called \"Pool\" that has songs that are: at least 3 stars, longer than 30 seconds (to avoid terrible \"skits\"), and not holiday music. Then, I have another playlist called \"Good\" that takes only songs in Pool that are 4 or 5 stars, and haven't been listened to in the last month. This is my main list to listen to: it rotates my favorite songs and doesn't get stuck on the same songs over and over. Nothing like this is possible to Rdio or Spotify.</span></span></div>\n</div></div></div></div></div>","frontmatter":{"title":"Spotify & Rdio","date":"July 14, 2011"}}},"pageContext":{"slug":"/2011/07/14/spotify-rdio/","previous":{"fields":{"slug":"/2011/06/23/kind-of-screwed-devils-advocate-edition/"},"frontmatter":{"title":"Kind of Screwed - Devil's Advocate Edition"}},"next":{"fields":{"slug":"/2011/07/24/i-think-the-cable-companies-are-screwed/index.html/"},"frontmatter":{"title":"I Think the Cable Companies are Screwed"}}}}